-- Description: auto-created by ExcelToLua tool.
-- Author:jjc

module("message", package.seeall)


keys = {
	"﻿messageID", "messageapart", "messageType", "Button_1", "Button_2", "messagetext", "number", 
}

messageTable = {
    id_101 = {"1", "0", "0", "0", "%s的强化等级目前已达上限哦\n提升主将等级以提高等级上限！", "1", },
    id_102 = {"1", "0", "0", "0", "%s的精炼等级目前已达上限哦\n提升主将等级以提高等级上限！", "1", },
    id_103 = {"1", "0", "0", "0", "%s的属性已满，换件装备洗练吧！", "1", },
    id_104 = {"1", "2", "再想想", "确定", "取消后将无法替换本次洗炼属性\n确定取消吗", "0", },
    id_105 = {"1", "0", "0", "0", "没有添加强化材料，臣妾做不到啊！", "0", },
    id_106 = {"1", "2", "取消", "确定", "您将放弃当前的洗练结果\n重新洗练1次\n(此提示今日不会再出现）", "0", },
    id_107 = {"1", "2", "取消", "确定", "您将放弃当前的洗练结果\n重新洗练5次\n(此提示今日不会再出现）", "0", },
    id_108 = {"1", "2", "取消", "确定", "您将放弃当前的洗练结果\n重新洗练10次\n(此提示今日不会再出现）", "0", },
    id_109 = {"1", "0", "0", "0", "没强化过的装备不可以洗练哦，主公！", "0", },
    id_110 = {"1", "0", "0", "0", "没强化过的装备不可以精炼哦，主公！", "0", },
    id_111 = {"1", "0", "0", "0", "洗炼石不足，无法洗炼哦主公！", "0", },
    id_112 = {"1", "0", "0", "0", "洗练属性已达上限\n请提升装备强化等级以提升洗炼属性上限！", "0", },
    id_113 = {"1", "0", "0", "0", "消耗所需%s不足哦，主公！", "1", },
    id_201 = {"1", "2", "炼化将魂", "商店购买", "当前武将升级经验不够的说！", "0", },
    id_202 = {"1", "0", "0", "0", "武将级别不可以超越主将级别哦！", "0", },
    id_203 = {"1", "0", "0", "0", "经验池都要满了，先升级武将吧！", "0", },
    id_204 = {"1", "0", "0", "0", "要按照顺序激活丹药哦，主公！", "0", },
    id_205 = {"1", "0", "0", "0", "介个职业还木有激活呐！", "0", },
    id_206 = {"1", "0", "0", "0", "主公您的星魂不足哦，去打副本获取星魂吧！", "0", },
    id_207 = {"1", "0", "0", "0", "%s的等级不足，无法升级天命哦，提升等级吧！", "1", },
    id_208 = {"1", "0", "0", "0", "%s的等级不足，无法合成丹药哦，提升等级吧！", "1", },
    id_209 = {"1", "0", "0", "0", "您的等级不足啊主公，快快练级去吧！", "0", },
    id_210 = {"1", "0", "0", "0", "升级天命所需的物品不足！", "0", },
    id_301 = {"1", "2", "取消", "抽一个去", "还木有可以上阵的武将哦，主公！", "0", },
    id_401 = {"1", "0", "0", "0", "购买成功", "0", },
    id_402 = {"1", "0", "0", "0", "东西已经卖光了哦，主公！", "0", },
    id_403 = {"1", "2", "取消", "确定", "是否花费%d%s刷新商店？\n（今日还可以刷新%d次）", "2", },
    id_501 = {"1", "1", "朕知道了", "0", "物品栏不足！物品已为您保存至邮件里！", "0", },
    id_502 = {"1", "0", "0", "0", "出售成功，您获得了%d银币！", "1", },
    id_503 = {"1", "0", "0", "0", "您的物品栏不足哦！", "0", },
    id_504 = {"1", "0", "0", "0", "没有金钥匙无法开启宝箱！", "0", },
    id_505 = {"1", "0", "0", "0", "没有银钥匙无法开启宝箱！", "0", },
    id_601 = {"1", "0", "0", "0", "背包已满，无法收取邮件！", "0", },
    id_602 = {"1", "0", "0", "0", "恭喜您领取成功！", "0", },
    id_701 = {"1", "0", "0", "0", "登陆信息输入不完整哦，主公！", "0", },
    id_702 = {"1", "0", "0", "0", "该账号不存在哦！记错了吧主公！", "0", },
    id_703 = {"1", "0", "0", "0", "密码不正确，请重新输入！", "0", },
    id_704 = {"1", "0", "0", "0", "账号必须大于3个字符不得小于15个字符哦！\n支持字母、符号、数字，区分大小写呢！主公！", "0", },
    id_705 = {"1", "0", "0", "0", "密码至少要大于6个字符，小于16个字符哦！", "0", },
    id_706 = {"1", "0", "0", "0", "您的账号已经被占用了\n用一个更加牛逼闪闪的账号吧，主公！", "0", },
    id_707 = {"1", "0", "0", "0", "前后密码不一致哦，请重新输入！", "0", },
    id_901 = {"1", "0", "0", "0", "您的名字已经被占用了，主公！", "0", },
    id_902 = {"1", "0", "0", "0", "输入名字太长了哦！", "0", },
    id_903 = {"1", "0", "0", "0", "输入名字太短了哦！", "0", },
    id_904 = {"1", "0", "0", "0", "主公，您不能起这样的名字哦！", "0", },
    id_1001 = {"1", "0", "0", "0", "物品不足，慢慢积攒吧主公！", "0", },
    id_1002 = {"1", "2", "取消", "确定", "元宝不足，国库空虚啊，是否前往充值？", "0", },
    id_1003 = {"1", "0", "0", "0", "银币不足", "0", },
    id_1004 = {"1", "2", "去商店", "确定", "消耗1盒%s补充%d点体力\n是否考虑吃一盒？\n（持有%d盒）", "3", },
    id_1005 = {"1", "0", "0", "0", "功勋值不足哦主公！", "0", },
    id_1006 = {"1", "0", "0", "0", "用户形象设置成功", "0", },
    id_1007 = {"1", "0", "0", "0", "帮贡不足！", "0", },
    id_1010 = {"1", "0", "0", "0", "vip等级限制", "0", },
    id_1023 = {"1", "0", "0", "0", "物品不足", "0", },
    id_1026 = {"1", "0", "0", "0", "军团贡献不足", "0", },
    id_1027 = {"1", "0", "0", "0", "比武声望不足，无法购买", "0", },
    id_1040 = {"1", "0", "0", "0", "处理申请操作失败！", "0", },
    id_1041 = {"1", "0", "0", "0", "军团名字已存在。", "0", },
    id_1042 = {"1", "0", "0", "0", "该军团不存在。", "0", },
    id_1043 = {"1", "0", "0", "0", "您不是军团长，无权完成该操作。", "0", },
    id_1044 = {"1", "0", "0", "0", "获取军团邀请列表失败。", "0", },
    id_1045 = {"1", "0", "0", "0", "获取军团成员列表失败。", "0", },
    id_1046 = {"1", "0", "0", "0", "军团科技操作失败。", "0", },
    id_1047 = {"1", "0", "0", "0", "该玩家没有加入军团。", "0", },
    id_1048 = {"1", "0", "0", "0", "离开军团失败。", "0", },
    id_1049 = {"1", "0", "0", "0", "该军团申请列表已满，无法再申请。", "0", },
    id_1050 = {"1", "0", "0", "0", "该玩家已经不在申请列表中。", "0", },
    id_1051 = {"1", "0", "0", "0", "处理申请操作失败！", "0", },
    id_1052 = {"1", "0", "0", "0", "军团设置失败。", "0", },
    id_1053 = {"1", "0", "0", "0", "捐献次数已用完，无法捐献。", "0", },
    id_1054 = {"1", "0", "0", "0", "您已经领取过食堂奖励，暂时无法再次领取。", "0", },
    id_1055 = {"1", "0", "0", "0", "该玩家已经加入其他军团。", "0", },
    id_1056 = {"1", "0", "0", "0", "军团成员已满，无法通过申请。", "0", },
    id_1057 = {"1", "0", "0", "0", "您的权限不足，无法完成该操作。", "0", },
    id_1058 = {"1", "0", "0", "0", "您所选的国家战力过高，无法进入。", "0", },
    id_1060 = {"1", "0", "0", "0", "您尚未加入任何军团。", "0", },
    id_1062 = {"1", "0", "0", "0", "申请无效，并没有申请过这个军团。", "0", },
    id_1064 = {"1", "0", "0", "0", "您的等级不足，已经无法雇佣更多的佣兵了", "0", },
    id_1065 = {"1", "0", "0", "0", "佣兵科技无效", "0", },
    id_1066 = {"1", "0", "0", "0", "佣兵刷新已到上限", "0", },
    id_1067 = {"1", "0", "0", "0", "佣兵刷新资源不足", "0", },
    id_1068 = {"1", "0", "0", "0", "您所选择的佣兵不存在", "0", },
    id_1069 = {"1", "0", "0", "0", "续费失败", "0", },
    id_1070 = {"1", "0", "0", "0", "该佣兵持续时间已经到达上限，无法再次续费", "0", },
    id_1072 = {"1", "0", "0", "0", "您的输入包含屏蔽字，请重新输入", "0", },
    id_1075 = {"1", "0", "0", "0", "次数尚未使用完，无需购买次数", "0", },
    id_1076 = {"1", "0", "0", "0", "奖励已经领取过", "0", },
    id_1079 = {"1", "0", "0", "0", "灵兽科技等级不足", "0", },
    id_1080 = {"1", "0", "0", "0", "进贡声望不足", "0", },
    id_1101 = {"1", "0", "0", "0", "主公，这个玩家不在线哦！", "0", },
    id_1102 = {"1", "0", "0", "0", "木有这个人吖，弄错名字了吧？", "0", },
    id_1103 = {"1", "0", "0", "0", "主公，请选择一个萌萌哒帮会成员吧！", "0", },
    id_1104 = {"1", "0", "0", "0", "主公，您还没有输入文字呢！", "0", },
    id_1105 = {"1", "0", "0", "0", "消耗品不足无法发言呢！", "0", },
    id_1106 = {"1", "0", "0", "0", "您还有%d秒可以发言！", "1", },
    id_1201 = {"1", "2", "取消", "确定", "花费%d%s增加挑战次数？今日还可买%d次。", "3", },
    id_1202 = {"1", "2", "取消", "确定", "是否花费%d元宝购买%d点精力？", "2", },
    id_1203 = {"1", "2", "取消", "确定", "是否花费%d元宝重置CD时间？", "1", },
    id_1204 = {"1", "2", "有钱，任性！", "摸一把", "哎丫丫，主公，您还没摸奖哩！", "1", },
    id_1205 = {"1", "0", "0", "0", "您还在比武CD中呢！", "0", },
    id_1206 = {"1", "0", "0", "0", "该玩家的名次在本场战斗结束前已经发生了改变\n您需要刷新当前比武对手！", "0", },
    id_1207 = {"1", "0", "0", "0", "玩家正在战斗中，请稍后再试", "0", },
    id_1208 = {"1", "0", "0", "0", "比武数据不正确！", "0", },
    id_1210 = {"1", "0", "0", "0", "未满足牢房开启条件", "0", },
    id_1211 = {"1", "0", "0", "0", "该商店已经关闭", "0", },
    id_1212 = {"1", "0", "0", "0", "商店管理类不存在", "0", },
    id_1213 = {"1", "0", "0", "0", "商店数据为旧数据，需要刷新", "0", },
    id_1215 = {"1", "0", "0", "0", "该官职任命已满或当前军团并未拥有该官职", "0", },
    id_1216 = {"1", "0", "0", "0", "军团科技等级不足", "0", },
    id_1217 = {"1", "0", "0", "0", "注资已满，无需注资", "0", },
    id_1218 = {"1", "2", "取消", "去捐献", "军团银币不足", "0", },
    id_1222 = {"1", "0", "0", "0", "军团科技升级中", "0", },
    id_1223 = {"1", "0", "0", "0", "商店剩余可刷新次数不足", "0", },
    id_1225 = {"1", "0", "0", "0", "科技等级不足", "0", },
    id_1227 = {"1", "0", "0", "0", "声望已经足够进贡，无需金币进贡", "0", },
    id_1228 = {"1", "0", "0", "0", "今日进贡次数已满", "0", },
    id_1229 = {"1", "0", "0", "0", "当前已经是赐福状态不能继续进贡", "0", },
    id_1230 = {"1", "0", "0", "0", "当前不是赐福状态不能赐福", "0", },
    id_1234 = {"1", "0", "0", "0", "未离开军团无法叛国，请离开您的军团后重试！", "0", },
    id_1239 = {"1", "0", "0", "0", "神树经验已满", "0", },
    id_1301 = {"1", "1", "确定", "0", "扫荡结束！奖励已为您发送至邮箱！", "0", },
    id_1302 = {"1", "0", "0", "0", "正在扫荡%d层", "1", },
    id_1303 = {"1", "0", "0", "0", "您当前位于塔的底层，无需重置！", "0", },
    id_1304 = {"1", "0", "0", "0", "重置次数不足，无法重置！", "0", },
    id_1305 = {"1", "0", "0", "0", "您已在塔的顶层，马上就打完啦\n不需要立即结束了。", "0", },
    id_1306 = {"1", "2", "取消", "确定", "是否花费%d元宝立即完成扫荡？", "1", },
    id_1307 = {"1", "2", "取消", "确定", "是否重置爬塔？\n（重置后回到底层）今日还可买%d次。", "1", },
    id_1308 = {"1", "0", "0", "0", "当前在可扫荡的最高层，需重置后才能扫荡", "0", },
    id_1309 = {"1", "0", "0", "0", "扫荡中无法重置！", "0", },
    id_1310 = {"1", "0", "0", "0", "当前层次任务失败，请重置后再来吧！", "0", },
    id_1311 = {"1", "0", "0", "0", "很可惜未满足通关条件，爬塔失败了哦。", "0", },
    id_1401 = {"1", "0", "0", "0", "该陆点无法直接抵达！", "0", },
    id_1402 = {"1", "0", "0", "0", "只能同时向10个军团发起申请！", "0", },
    id_1403 = {"1", "0", "0", "0", "这个军团排队申请的人实在太多\n主公我们换一个军团吧排队吧！", "0", },
    id_1404 = {"1", "0", "0", "0", "您的等级不符合需求哦！", "0", },
    id_1405 = {"1", "0", "0", "0", "该军团人数已满，请重新选择一个军团加入吧！", "0", },
    id_1406 = {"1", "0", "0", "0", "恭喜您已加入%d", "1", },
    id_1407 = {"1", "0", "0", "0", "已向该军团发送申请。", "0", },
    id_1408 = {"1", "0", "0", "0", "该军团无法加入！", "0", },
    id_1409 = {"1", "0", "0", "0", "军团名称必须大于1个字，小于8个字哦。", "0", },
    id_1410 = {"1", "0", "0", "0", "该军团名称已存在。", "0", },
    id_1411 = {"1", "0", "0", "0", "%d的实力过强，已无我军安身立命之地！", "1", },
    id_1412 = {"1", "0", "0", "0", "军团ID应该是6位的数字哦！", "0", },
    id_1413 = {"1", "0", "0", "0", "没有这个军团哦！", "0", },
    id_1414 = {"1", "2", "取消", "确定", "您是否花费%s%s创建军团？", "2", },
    id_1415 = {"1", "0", "0", "0", "修改成功！", "0", },
    id_1416 = {"1", "0", "0", "0", "请输入正确的军团名字！", "0", },
    id_1417 = {"1", "0", "0", "0", "该名字已被占用，请换个军团名字吧！", "0", },
    id_1418 = {"1", "0", "0", "0", "主公，您好像没有更改军团名字啊！", "0", },
    id_1438 = {"1", "0", "0", "0", "要求输入大于1个字，小于20个字！", "0", },
    id_1419 = {"1", "0", "0", "0", "要求输入大于1个字，小于30个字！", "0", },
    id_1420 = {"1", "0", "0", "0", "请输入正确的文字！", "0", },
    id_1421 = {"1", "0", "0", "0", "申请通过", "0", },
    id_1422 = {"1", "0", "0", "0", "该请求已失效", "0", },
    id_1423 = {"1", "0", "0", "0", "已拒绝", "0", },
    id_1424 = {"1", "0", "0", "0", "恭喜您成功加入%s军团！", "1", },
    id_1425 = {"1", "2", "取消", "确定", "您确定要将%s请离军团吗？", "1", },
    id_1426 = {"1", "0", "0", "0", "操作成功！", "0", },
    id_1427 = {"1", "2", "取消", "确定", "您确定将将军的权利转交给%s吗？（转交后您将成为普通团员）", "1", },
    id_1428 = {"1", "0", "0", "0", "操作成功！", "0", },
    id_1429 = {"1", "0", "0", "0", "军团已经有一位副将了哦！", "0", },
    id_1430 = {"1", "0", "0", "0", "军团可提拔的圣女位置已满！", "0", },
    id_1431 = {"1", "0", "0", "0", "军团可提拔的护法位置已满！", "0", },
    id_1432 = {"1", "0", "0", "0", "主公您身担将军重职，不可以弃大家不顾啊！", "0", },
    id_1433 = {"1", "0", "0", "0", "主公，%s的实力过强，已无我军安身立命之地！", "1", },
    id_1434 = {"1", "0", "0", "0", "仅每周一允许修改国籍，请主公稍安勿躁，静待时机。", "0", },
    id_1435 = {"1", "0", "0", "0", "已宣誓效忠%s！", "1", },
    id_1440 = {"1", "0", "0", "0", "未更换国家！", "0", },
    id_1441 = {"1", "0", "0", "0", "升级当前科技需要%s到达%d！", "2", },
    id_1442 = {"1", "0", "0", "0", "当前物资不够注资哦！", "0", },
    id_1443 = {"1", "0", "0", "0", "科技研发成功！", "0", },
    id_1444 = {"1", "0", "0", "0", "领取成功，获得%d点经验奖励", "1", },
    id_1445 = {"1", "0", "0", "0", "领取成功！", "0", },
    id_1446 = {"1", "0", "0", "0", "捐献成功！", "0", },
    id_1447 = {"1", "0", "0", "0", "当前没有可以突进的队伍！", "0", },
    id_1448 = {"1", "0", "0", "0", "当期没有可撤退队伍！", "0", },
    id_1451 = {"1", "0", "0", "0", "获取军团成员列表失败", "0", },
    id_1452 = {"1", "0", "0", "0", "您没有权限对该玩家进行操作", "0", },
    id_1453 = {"1", "0", "0", "0", "所选国家战斗力过高，暂时不接受加入", "0", },
    id_1454 = {"1", "0", "0", "0", "您的元宝不足，无法改变军团国家", "0", },
    id_1455 = {"1", "2", "确定", "取消", "是否确定离开军团？", "0", },
    id_1456 = {"1", "0", "0", "0", "成功释放%d个%s的分身", "2", },
    id_1457 = {"1", "0", "0", "0", "该队伍不在城中，释放分身失败。", "0", },
    id_1458 = {"1", "2", "去升级", "取消", "当前科技为0级，请升级科技后再来", "0", },
    id_1459 = {"1", "0", "0", "0", "主将等级已满，无法使用", "0", },
    id_1460 = {"1", "0", "0", "0", "成功领取%s%d", "2", },
    id_1461 = {"1", "0", "0", "0", "恭喜您成功雇佣一支佣兵队伍为您作战", "0", },
    id_1462 = {"1", "0", "0", "0", "您已经无法再雇佣更多的佣兵了", "0", },
    id_1463 = {"1", "2", "确定", "取消", "是否确认解雇该佣兵？", "0", },
    id_1464 = {"1", "2", "取消", "确定", "本次刷新佣兵需要花费%s%d，是否刷新？", "2", },
    id_1465 = {"1", "1", "确定", "0", "解雇时，不会将该佣兵所剩余的天数折算成资源返还给玩家", "0", },
    id_1466 = {"1", "1", "确定", "0", "获取信息失败，请检查网络设置", "0", },
    id_1467 = {"1", "0", "0", "0", "该佣兵已经被雇佣", "0", },
    id_1468 = {"1", "0", "0", "0", "名字中不能包含空格", "0", },
    id_1469 = {"1", "0", "0", "0", "名字过长，请重新输入", "0", },
    id_1470 = {"1", "0", "0", "0", "等级不足，无法雇佣更多佣兵", "0", },
    id_1471 = {"1", "1", "确定", "0", "名字包含敏感字符，请重新输入", "0", },
    id_1472 = {"1", "0", "0", "0", "今日已签到，无法再签到", "0", },
    id_1473 = {"1", "0", "0", "0", "神树刚开始成长，尚未有任何奖励可以领取", "0", },
    id_1474 = {"1", "0", "0", "0", "您已经离开军团！天大地大何处为家？？？", "0", },
    id_1475 = {"1", "0", "0", "0", "主公，再经过%d小时%d分钟%d秒，才可再次加入军团。", "3", },
    id_1476 = {"1", "1", "确定", "0", "签到成功", "0", },
    id_1477 = {"1", "1", "确定", "0", "主公，前方发现新版本%.1f（%.1fM）\n请速速更新！", "2", },
    id_1478 = {"1", "0", "0", "0", "未查找到能炼化<%s>的材料", "1", },
    id_1479 = {"1", "0", "0", "0", "领取成功", "0", },
    id_1480 = {"1", "0", "0", "0", "客户端发送索引号错误", "0", },
    id_1481 = {"1", "0", "0", "0", "没有可领取的奖励", "0", },
    id_1482 = {"1", "0", "0", "0", "需要%s等级达到%d，才可以升级此可以", "2", },
    id_1483 = {"1", "1", "确定", "0", "该账号在别处登陆，请点击确定重试", "0", },
    id_1484 = {"1", "1", "确定", "0", "该账号已在登陆中，请点击确定重试", "0", },
    id_1485 = {"1", "0", "0", "0", "充值失败", "0", },
    id_1486 = {"1", "0", "0", "0", "主公您的名字有点短哦，不要问我短有什么不好", "0", },
    id_1487 = {"1", "0", "0", "0", "没有这个国家", "0", },
    id_1488 = {"1", "0", "0", "0", "您已经成功叛离到%s国。", "1", },
    id_1489 = {"1", "2", "确定", "取消", "是否花费%d元宝解除该队伍的牢狱状态？", "1", },
    id_1490 = {"2", "2", "购买", "取消", "刷新次数不足，\n是否花费%d的%s进行刷新？", "2", },
    id_1491 = {"1", "0", "0", "0", "佣兵已经过期，无法赐福", "0", },
    id_1492 = {"1", "0", "0", "0", "成功进贡%s，您现在可以进行%s赐福", "2", },
    id_1493 = {"1", "2", "确定", "取消", "是否花费%d元宝补齐缺少的声望，\n进行%s进贡", "2", },
    id_1494 = {"1", "0", "0", "0", "成功进行%s赐福", "1", },
    id_1495 = {"1", "0", "0", "0", "成功召唤灵兽%s，现在可以进行%s赐福", "2", },
    id_1496 = {"1", "2", "确定", "取消", "是否确定花费%d元宝解锁该牢房，\n解锁后该牢房无需再次解锁", "1", },
    id_1497 = {"1", "0", "0", "0", "领取牢房奖励成功", "0", },
    id_1498 = {"1", "0", "0", "0", "解锁牢房成功", "0", },
    id_1499 = {"1", "0", "0", "0", "使用天眼通成功", "0", },
    id_1500 = {"1", "0", "0", "0", "使用无影手成功", "0", },
    id_1501 = {"1", "2", "确定", "取消", "是否确定花费%d元宝进行军团捐献？", "1", },
    id_1502 = {"1", "0", "0", "0", "路线被迷雾城池阻挡，无法移动", "0", },
    id_1503 = {"1", "0", "0", "0", "%s城池附近迷雾已经被解锁", "1", },
    id_1504 = {"1", "0", "0", "0", "您的权限不足，不能对该科技进行注资", "0", },
    id_1505 = {"1", "1", "去充值", "0", "功能未开启，玩家等级达到%d，\n或VIP等级到达%d，\n方可开启！", "2", },
    id_1506 = {"2", "1", "去充值", "0", "购买次数不足，或提升VIP等级到达%d，\n将增加到%d次！", "2", },
    id_1507 = {"1", "0", "0", "0", "您现在还没有加入任何军团", "0", },
    id_1508 = {"1", "2", "确定", "取消", "是否确定花费%d元宝将挑战次数补满", "1", },
    id_1509 = {"1", "2", "确定", "取消", "是否确定花费%d元宝重置挑战CD", "1", },
    id_1610 = {"1", "0", "0", "0", "银币不足", "0", },
    id_1611 = {"1", "0", "0", "0", "元宝不足", "0", },
    id_1612 = {"1", "0", "0", "0", "超过主将等级", "0", },
    id_1613 = {"1", "0", "0", "0", "体力不足", "0", },
    id_1614 = {"1", "0", "0", "0", "获取商店失败", "0", },
    id_1615 = {"1", "0", "0", "0", "主将等级限制", "0", },
    id_1616 = {"1", "0", "0", "0", "敬请期待", "0", },
    id_1617 = {"1", "0", "0", "0", "非本国军团，不可申请加入", "0", },
    id_1618 = {"1", "2", "确定", "取消", "是否确定将%s请离军团？", "1", },
    id_1619 = {"1", "0", "0", "0", "已成功将%s任命为%s", "2", },
    id_1620 = {"1", "0", "0", "0", "没有修改该成员的官职", "0", },
    id_1621 = {"1", "0", "0", "0", "军团贡献不足", "0", },
    id_1622 = {"1", "1", "确定", "0", "您已被请出军团或军团已解散", "0", },
    id_1623 = {"1", "0", "0", "0", "账号不允许输入空格，\n请重新输入", "0", },
    id_1624 = {"1", "0", "0", "0", "账号不允许输入汉字，\n请重新输入", "0", },
    id_1625 = {"1", "0", "0", "0", "账号长度必须介于6~12个字符之间，\n支持字母数字且不区分字母大小写", "0", },
    id_1626 = {"1", "0", "0", "0", "该账号已经存在，\n请重新输入", "0", },
    id_1627 = {"1", "0", "0", "0", "密码长度必须介于6~12个字符之间，\n支持字母数字且不区分字母大小写", "0", },
    id_1628 = {"1", "0", "0", "0", "确认密码与输入密码不一致，\n请检查后重新输入", "0", },
    id_1629 = {"2", "2", "确定", "取消", "花费%d%s重置次数？\n今日还可买%d次。", "3", },
    id_1630 = {"2", "2", "确定", "取消", "花费%d%s重置进度？\n今日还可买%d次。", "3", },
    id_1631 = {"2", "2", "确定", "取消", "花费%d%s重置捐献次数？\n今日还可买%d次。", "3", },
    id_1632 = {"2", "2", "确定", "取消", "花费%d%s重置领取次数？\n今日还可买%d次。", "3", },
    id_1633 = {"2", "2", "确定", "取消", "花费%d%s多完成%d次军团任务？\n今日还可买%d次。", "4", },
    id_1634 = {"1", "1", "去充值", "0", "玩家VIP等级到达%d，\n方可开启！", "1", },
    id_1635 = {"1", "0", "0", "0", "成功获得%s赐福", "1", },
    id_1636 = {"1", "0", "0", "0", "您已经是该国家的成员，无法叛离到该国家", "0", },
    id_1637 = {"1", "0", "0", "0", "当前道具数量已经足够缩减全部研发时间，无需再增加", "0", },
    id_1638 = {"1", "0", "0", "0", "无法再减少道具使用数量", "0", },
    id_1639 = {"1", "0", "0", "0", "拥有道具不足，无法继续添加", "0", },
    id_1640 = {"1", "0", "0", "0", "调养成功，使用%d%s个", "2", },
    id_1641 = {"1", "0", "0", "0", "恭喜你，你的%d等级提升到%s级", "2", },
    id_1642 = {"1", "0", "0", "0", "您的%d等级已经最高，无法继续使用该道具", "1", },
    id_1643 = {"1", "0", "0", "0", "%s将在您主将等级达到%d后开启！", "2", },
    id_1644 = {"1", "1", "去充值", "0", "购买次数不足，\n提升VIP等级到达%d，\n将增加到%d次！", "2", },
    id_1645 = {"1", "0", "0", "0", "未达到解锁该头像条件", "0", },
    id_1646 = {"1", "0", "0", "0", "您没有权限将该玩家请离军团", "0", },
    id_1647 = {"1", "1", "确定", "0", "您当前比武排名%d\n超过您以往最高记录\n请到邮箱领取排名跃升奖励", "1", },
    id_1648 = {"1", "0", "0", "0", "该玩家已经是%s，无需再次任命", "1", },
    id_1649 = {"1", "1", "确定", "0", "当日购买次数为0，无法购买。", "2", },
    id_1650 = {"1", "2", "确定", "取消", "一键强化会一次性消耗所需银币\n将当前武将身上所有装备强化至最高\n是否确定一键强化？", "0", },
    id_1651 = {"1", "0", "0", "0", "您未穿戴任何装备，无法一键强化", "0", },
    id_1652 = {"1", "0", "0", "0", "装备均已强化至最高或者银币不足，无法强化", "0", },
    id_1653 = {"1", "0", "0", "0", "银币不足，无法一键强化", "0", },
    id_1654 = {"1", "1", "确定", "0", "服务器维护中", "0", },
    id_1655 = {"1", "0", "0", "0", "未选中任何道具，无法出售", "0", },
    id_1656 = {"1", "1", "确定", "0", "您的游戏不是最新版本，请更新最新版本", "0", },
    id_1657 = {"1", "0", "0", "0", "主将等级达到%d，且通关第%d章后开启精英关卡", "2", },
    id_1658 = {"1", "0", "0", "0", "主将等级达到%d后开启活动关卡", "1", },
    id_1659 = {"1", "1", "确定", "0", "新手引导操作失败，请重新登陆", "0", },
}


function getDataById(key_id)
    local id_data = messageTable["id_" .. key_id]
    if id_data == nil then
        return nil
    end
    return id_data
end

function getArrDataByField(fieldName, fieldValue)
    local arrData = {}
    local fieldNo = 1
    for i=1, #keys do
        if keys[i] == fieldName then
            fieldNo = i
            break
        end
    end

    for k, v in pairs(messageTable) do
        if tostring(v[fieldNo-1]) == tostring(fieldValue) then
            table.insert(arrData, copyTab(v))
        end
    end

    return arrData
end

function getTable()
    return messageTable
end


function getFieldByIdAndIndex(key_id, fieldName)
    local fieldNo = 0
    for i=1, #keys do
        if keys[i] == fieldName then
            fieldNo = i-1
            break
        end
    end
    return getDataById(key_id)[fieldNo]
end


function getIndexByField(fieldName)
    local fieldNo = 0
    for i=1, #keys do
        if keys[i] == fieldName then
            fieldNo = i-1
            break
        end
    end
    return fieldNo
end


function getArrDataBy2Field(fieldName1, fieldValue1, fieldName2, fieldValue2)
	local arrData = {}
	local fieldNo1 = 1
	local fieldNo2 = 1
	for i=1, #keys do
		if keys[i] == fieldName1 then
			fieldNo1 = i
		end
		if keys[i] == fieldName2 then
			fieldNo2 = i
		end
	end

    for k, v in pairs(messageTable) do
        if tostring(v[fieldNo1-1]) == tostring(fieldValue1) and tostring(v[fieldNo2-1]) == tostring(fieldValue2)  then
            table.insert(arrData, copyTab(v))
        end
    end

    return arrData
end



function release()
    _G["message"] = nil
    package.loaded["message"] = nil
end
