-- Description: auto-created by ExcelToLua tool.
-- Author:jjc

module("nor_copydata", package.seeall)


keys = {
	"﻿id", "point_des", "point_pos_1", "point_pos_2", "point_pos_3", "point_pos_4", "point_pos_5", "point_item1", "point_item2", "point_item3", "point_item4", 
}

nor_copydataTable = {
    id_10101 = {"我滴乖乖，这都哪跟哪啊，我刚才还在厕所里抽烟，怎么一抽马桶我就跟着水一起被冲走了~仔细问问，味还挺重的……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_3", "POS_3_1", "1012", "36105", "36105", "218", },
    id_10102 = {"走了这么久，随处可见黄巾贼寇烧杀抢掠，这哪是替天行事啊，简直就是犹如畜生一般的宗教暴行啊，不是说好的禁止宗教游行嘛！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_3", "POS_3_1", "1013", "36105", "36105", "218", },
    id_10103 = {"老师告诉我，黄巾军是农民起义，由于东汉末年皇帝昏庸，可是看这寨子的建筑风格，怎么看怎么都像是个山贼的寨子……老师你蒙我……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_3", "POS_3_1", "1014", "36102", "36102", "218", },
    id_10104 = {"黄巾军的头头应该是个叫张角的家伙吧，还号令什么苍天已死，黄天当道，你们那边是天天都刮沙尘暴么？！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_3", "POS_3_1", "1011", "36101", "36101", "218", },
    id_10105 = {"张角这个胆小鬼，就会用别人当挡箭牌！还呼风唤雨的，你当你是天气预报啊，看我废了他的黄天鬼道！为村口的理发王师傅报仇！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_3", "POS_3_1", "1012", "1013", "36105", "218", },
    id_10201 = {"我觉得张角学太平道，别的没学会，跑路到学的666的，一溜烟就没影了，我看比大卫的魔术还厉害……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_3", "POS_3_1", "1022", "36105", "36105", "218", },
    id_10202 = {"天了噜，这世间真的有妖术？不过仔细想想，这哪是妖术，你嘴里含着酒精喷火炬是给我表演马戏团吗？少废话，张宝拿命来！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_3", "POS_3_1", "1023", "36105", "36105", "218", },
    id_10203 = {"哇塞！！！！那个英姿飒爽的人不就是大财团的曹老板么！我现在就跟他说让他去二环买房他一定会感谢我的！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_3", "POS_3_2", "1024", "36102", "36102", "218", },
    id_10204 = {"看来这黄巾贼还是一群砝码， 种田应该可以，至于打仗嘛~还不一定谁怕谁呢，我这凶神恶煞的劲儿连我家狗狗也让我三分！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_3", "POS_3_2", "1021", "36101", "36101", "218", },
    id_10205 = {"我靠！这是常山赵子龙嘛！还是自带BGM自带掌声自带灯光的男人啊，放到现在绝对是个影视歌三栖的全能艺人那！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_3", "POS_3_3", "1022", "36105", "36105", "218", },
    id_10206 = {"历史老师说过，农民起义基本最后都是被镇压下去了，原因就在于，都是农民，连玉玺正反面都不知道！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_4", "POS_3_3", "1023", "36105", "36105", "218", },
    id_10207 = {"张角你就是个大骗子！你拿的太平道是山寨的吧！少在这拿着盗版图书祸害祖国下一代了！我代表文化部消灭你！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_4", "POS_3_3", "1024", "1023", "36101", "218", },
    id_10301 = {"董卓这个大胖子，吃着碗里看着锅里的！食火这么大，到最后必然导致暴虐成性！这也是人性的演化过程！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_4", "POS_3_1", "1022", "36105", "36105", "218", },
    id_10302 = {"这一时间段的人民真也是苦命，先是黄巾贼，后是董胖子！我真是心疼老百姓啊，有钱的打仗，穷人连打（哔）的能力都丧失了！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_4", "POS_3_2", "1023", "36101", "36101", "218", },
    id_10303 = {"听说张济的老婆很漂亮耶~~后来被曹操强纳之，结果遭张绣突袭，死了儿子丢了大将，连坐骑绝影也死于战场，人妻控是要遭报应哒！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_4", "POS_3_3", "1024", "36102", "36102", "218", },
    id_10304 = {"虎牢关的守卫真是一个个膀大腰圆，真不知道是吃了哪家猪饲料喂起来的，还是因为都是和董胖子是亲戚？！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_4", "POS_3_3", "1021", "36101", "36101", "218", },
    id_10305 = {"哇！那不是关二姐么！难得看关二姐这么拼命，二姐的大刀早已经饥渴难耐了！去吧！就决定是你了，关二姐！（叫声：关关~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_4", "POS_3_3", "1022", "36105", "36105", "218", },
    id_10306 = {"据说华雄自称吕布之下第一人，这牛鼻子都快吹到南太平洋去了，这么能吹牛你怎么不上天啊~！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "1023", "36101", "36101", "218", },
    id_10307 = {"不愧是关二姐，直接秒杀华雄，让他还这么嘚瑟，瞅瞅你内损色，不知道出来混迟早是要还的嘛？", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "1024", "36101", "36101", "218", },
    id_10308 = {"为，为何我的身体开始发抖，似乎感觉到前方有一股莫名的杀气，这人战斗力得200000000000…啊！我的侦查器爆炸了……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "1021", "36101", "36101", "218", },
    id_10309 = {"吕布欧巴出现了~简直狂拽酷炫吊炸天啊~~出来的时候都感觉脚踩七色莲……哦不对，是云彩~！！~[星星眼][桃心]~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "1022", "1023", "36005", "218", },
    id_10401 = {"这凤仪亭清幽典雅，简直是个私通相会的不二选择啊，王允也真是煞费心机，还特地带了摄像团队……。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "1032", "36101", "36101", "218", },
    id_10402 = {"凤仪亭里，到处都是王允的眼线，我也得见机行事，先敲晕个侍卫换件衣服再说！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "1033", "36105", "36105", "218", },
    id_10403 = {"王允这导演做的到位啊，拍了一出连环计，他和大镁铝貂蝉的配合简直天衣无缝啊，在下佩服佩服。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "1034", "36101", "36101", "218", },
    id_10404 = {"看那边，吕布和他的护卫已经出来了，我的天，连吕布的护卫都这么帅，这人应该是张辽吧？", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "1031", "36105", "36105", "218", },
    id_10405 = {"吕布的贴身侍卫各个都身怀绝技，绝对不容小觑，不过我也好歹已经把自己天命强化到9999999了！应该不叫事！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "1032", "36101", "36101", "218", },
    id_10406 = {"眼看我们的吕布大帅哥就要被貂蝉MM玩坏了，心中突然有点小心疼啊~！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "1033", "36105", "36105", "218", },
    id_10407 = {"貂蝉不愧是四大美女啊，连周围的侍女都宛若天仙，让人流连忘返啊！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "1034", "36101", "36101", "218", },
    id_10408 = {"哦！？那些侍女身后的想必就是传说中的大美女貂蝉了吧！这一趟凤仪亭值回票价了！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "1031", "36105", "36105", "218", },
    id_10409 = {"这两人简直是神仙眷侣啊，不过想到这貂蝉用美色去挑拨董卓和吕布之间，也是够污的！~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "1032", "36101", "36101", "218", },
    id_10410 = {"这董胖子怕是要回来了~眼看这一幕不知他心中会作何感想，姐妹撕逼大戏一触即发~期待！~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "1033", "36105", "36105", "218", },
    id_10411 = {"别看董卓膀大腰圆，也是能轻松拿取方天画戟的，不过也是孔武有力，耍不起来啊~吕布大爷跟绑了蹿天猴似的，嗖一下就没影了~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "1034", "1033", "36011", "218", },
    id_10501 = {"眼下当务之急是先铲除董卓这个大胖子，百姓连年叫苦，怕是过一阵又会出现什么绿巾军，红领巾的……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "1032", "36101", "36101", "218", },
    id_10502 = {"这长安城这么老大个啊，怪不得董大胖子誓要夺了这长安城，俗话说，这人肚有多大，舞台就有多大，真是厉害死你了…", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "1033", "36105", "36105", "218", },
    id_10503 = {"李肃其实也是明事理的人，知道跟着大胖子混没有好下场，每每皆是逢场作戏，实则趁机卸磨杀驴，心黑但也顺应天命。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "1034", "36101", "36101", "218", },
    id_10504 = {"董胖子听取了小妾（大误）李儒的计策，占长安，守太平，但是这也并非长久之计。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "1031", "36105", "36105", "218", },
    id_10505 = {"前方镇守的将领叫李傕，是东汉末年有名“臭皮匠”，这也就是赶上军阀混战，乱世之中，他才能兴风作浪。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "1032", "36101", "36101", "218", },
    id_10506 = {"再来说说李傕，他充其量也就是个三流的小混混，瞎玩瞎闹可以，有勇无谋，亏得有贾诩的妙计，要不然早就淹没再历史的洪流里了……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "1033", "36105", "36105", "218", },
    id_10507 = {"长安城自古以来就是很多君王的建都之地，历史老师告诉过我，这里可是13朝的首都呢~想着长安气候宜人，易守难攻，简直就是建都的最佳之选啊", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "1034", "36101", "36101", "218", },
    id_10508 = {"也不知道董胖子给李儒吃什么蜜了，就是死心塌地的跟着董大胖子，这份忠（ai）心（qing）实在令人赞（xi）叹（xu）不已啊……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "1031", "36105", "36105", "218", },
    id_10509 = {"说起来，李儒也算是董事集团的智囊团代表了，不过可惜了这份聪明，助纣为虐，和董大胖子双双殉情九泉~~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "1032", "36101", "36101", "218", },
    id_10510 = {"王允其实真的是一位忧国忧民，秉公办事的好官，为了东汉呕心沥血，愿意为国捐躯，可不曾想，历史上改朝换代都还不是因为那些国家高层的昏庸无能", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "1033", "36105", "36105", "218", },
    id_10511 = {"眼看这王允的计谋马上就要得逞了，突然有点替董胖子伤感了一下，董胖子曾经也风光一时，为主鞍前马后。落的如此田地，也因太过放纵自己的欲望！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "1034", "36101", "36101", "218", },
    id_10512 = {"王允虽然都快把董胖子和吕帅哥玩坏了，结果老人家最后居然犯了老干部上台的一大错误，高傲！还逼得原部下铤而走险反攻长安。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "1031", "36105", "36105", "218", },
    id_10513 = {"董胖子你这也是罪有应得，千不该万不该就是玩什么残忍嗜杀倒行逆施，最后给自己玩进去了也是咎由自取！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "1032", "1033", "36011", "218", },
    id_10601 = {"曹老板举兵攻打徐州，除了为老父报仇，而且徐州也是个在地理位置上，很重要的关卡要道，怎能不觊觎呢。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21062", "36101", "36101", "218", },
    id_10602 = {"徐州城戒备如此之严，连个小强都跑不进去，看来旁门是走不成了，何不顺势借着混乱从正门闯入呢！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21063", "36105", "36105", "218", },
    id_10603 = {"本来这陶谦和曹老板并无大仇，结果因其士兵贪图钱财，把人曹老板的爹给杀了，夺妻杀父之仇怎可不报？陶谦也是自知吃了哑巴亏……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21064", "36101", "36101", "218", },
    id_10604 = {"陶谦本事仁爱之将，治理徐州也是爱国爱民，同时也是提拔刘备之人，不过就是被当成曹老板登基的垫脚石了。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21061", "36105", "36105", "218", },
    id_10605 = {"前方数把弓箭齐射，这射箭之人也是有点手腕啊！待我前去看看！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21062", "36101", "36101", "218", },
    id_10606 = {"太史慈当真是有武有义之人，从小猿臂善射，弦不虚发，而且为了答谢孔融冒死向刘备求救，此等情义早已令世人敬佩！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21063", "36101", "36101", "218", },
    id_10607 = {"看来曹老板的大部队也来到徐州了，这下徐州是唾手可得，曹老板的杀父之仇也报的差不多了……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21064", "36101", "36101", "218", },
    id_10608 = {"前来的那位将领莫不是夏侯惇？不过想想一会夏侯惇眼睛被射瞎了就怕怕的……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21061", "36105", "36105", "218", },
    id_10609 = {"夏侯惇不愧是曹操集团第一猛将，不过吃了眼睛之后，感觉所有数值都下降一半啊，果然这内脏还是不能乱吃……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21062", "36101", "36101", "218", },
    id_10610 = {"曹老板把光明右使范……哦不对，是典韦也带来啦~徐州城里还未能见过可以和典韦肉搏的武将那~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21063", "36105", "36105", "218", },
    id_10611 = {"鬼才郭嘉的计谋就是趁乱将徐州拿下，不过这也费了曹操集团不少精力财力。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21064", "36101", "36101", "218", },
    id_10612 = {"作为曹老板的左右护法，典韦这一生救主三次，也真是鞠躬尽瘁死而后已，就是死的太早了，为了上位也是够拼的……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21061", "36101", "36101", "218", },
    id_10613 = {"夺徐州也是郭嘉的主意，他洞察了袁绍会先和公孙瓒撕逼，没时间来管徐州的事。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21062", "36101", "36101", "218", },
    id_10614 = {"如此之时，正好可以先拿下徐州，这样不仅可以扩大军力，也防止在之后的曹袁大战时，有人趁乱攻击后院。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21063", "36105", "36105", "218", },
    id_10615 = {"我去~郭嘉简直帅得掉渣啊，这稀疏的胡茬，这飘逸的长发，又爱出奇制胜~真是又有智慧又有品味~爱死了~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21061", "21063", "36030", "218", },
    id_10701 = {"这许都已经被两个小逗比土匪盘踞了，曹老板这次又要发力了，拭目以待。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21062", "36101", "36101", "218", },
    id_10702 = {"小贼就是小贼，花天酒地耍个女人还行，真要从政整军，就略显小家子气了。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21063", "36105", "36105", "218", },
    id_10703 = {"郭汜和李傕就是俩土匪头子，明明可以借个由头就告老还乡了，结果又跑出来挟天子，就是一个字，作死！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21064", "36101", "36101", "218", },
    id_10704 = {"就现在许都俩废物，其实真的不用夏侯惇，就许褚典韦就都办了。。不过典韦…………哭哭", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21061", "36105", "36105", "218", },
    id_10705 = {"叛军气数已近，这残垣断壁岂是曹操集团的对手。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21062", "36101", "36101", "218", },
    id_10706 = {"比起郭汜，李傕也好不了多少，俩人就因为分赃不均打的鸡飞狗跳，前者被自己手下所杀，后者被曹老板诛了三族…走好不送……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21063", "36105", "36105", "218", },
    id_10707 = {"曹老板为了镇压反贼也是带了众将来讨伐，土匪兄弟要遭殃了……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21064", "36101", "36101", "218", },
    id_10708 = {"夏侯惇是西汉开国元勋的夏侯婴后代，自小骁勇善战，最后也是成为曹魏的开国元勋啊。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21061", "36105", "36105", "218", },
    id_10709 = {"夏侯惇一生虽多在军旅，但仍不忘治学。也常亲自迎师，虚心求教，更是为人俭朴，所得赏赐全部分给将士。一生不置产业，至死家无余财。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21062", "36105", "36105", "218", },
    id_10710 = {"贾诩其实在李傕和郭汜掌管期间，也还是很心地善良，体恤百姓的。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21063", "36105", "36105", "218", },
    id_10711 = {"不过还是有人管他叫毒士，是因为他为了自保不惜牺牲整个城的百姓，杀人也基本不脏了自己的手。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21064", "36101", "36101", "218", },
    id_10712 = {"贾诩这小坏包，玩坏了董胖子，又玩上了李傕郭汜~不过这俩人不成气候，玩到一半就改玩我们曹老板去了~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21061", "36105", "36105", "218", },
    id_10713 = {"贾诩是玩别人，汉献帝是各种花式被玩，关键是自己本身志在四方，这股拧巴劲儿也真是难为这位皇子了。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21062", "36101", "36101", "218", },
    id_10714 = {"想想汉献帝还真是够惨的，被各种奇奇怪怪的人挟持了４０年，还没有人给他交赎金……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21063", "36105", "36105", "218", },
    id_10715 = {"曹老板终于学会了董胖子那一套，挟天子以令诸侯，不过相比董胖子，曹老板的智囊团更牛X，不想赢都难！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21061", "21063", "36009", "218", },
    id_10801 = {"这曹操挟了天子，下一步就开始假借正义干翻小吕布了，郭嘉这步棋走的也丝毫没有问题，为了之后的官渡之战做出了很多铺垫。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21062", "36101", "36101", "218", },
    id_10802 = {"这吕布身旁的将领真的没几个看上眼的，除了张辽是实力超群，其他都是不怎么中看也不怎么中用的人……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21063", "36105", "36105", "218", },
    id_10803 = {"AUV~~~听说这侯成还是个什么吕布八健将，我还是什么田径小王子呢，原来吕布是这么的中二？", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21064", "36101", "36101", "218", },
    id_10804 = {"想着吕布，真的是个人实力太光芒万丈，除了张辽这小弟还比较靠谱以外，缺少明星球员，这比赛能赢也怪了……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21061", "36105", "36105", "218", },
    id_10805 = {"如果是说缺少明星球员也就算了，还老有那种拉屎不擦屁股的，拖后腿的，这球队不解散等什么呢？", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21062", "36101", "36101", "218", },
    id_10806 = {"魏续这人也是吕布的八健将，不过我总觉得是因为他和吕布是亲家，走了后门，其实自己只是贪生怕死之人，最后还跳反投降曹老板……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21063", "36101", "36101", "218", },
    id_10807 = {"听说这陈宫本来是辅佐曹老板的，结果发生了件大事导致陈宫反水~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21064", "36101", "36101", "218", },
    id_10808 = {"原来是曹老板也不知道听谁的八卦，将兖州的几个名士处死，这里就有一些陈宫的好基友。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21061", "36105", "36105", "218", },
    id_10809 = {"不过就算如此，我觉得就以陈宫这种刚正不阿的劲儿，也是活不了多久的，最后也证明陈宫确实站错了队……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21062", "36101", "36101", "218", },
    id_10810 = {"下邳城百姓已经数日遭受水淹断粮了，城内民心军心皆以消耗殆尽。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21063", "36105", "36105", "218", },
    id_10811 = {"在这种身体和心灵双重打击下，真的没有几个人还可以从容淡定，投降也是早晚的事", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21064", "36101", "36101", "218", },
    id_10812 = {"眼看下邳城就要被攻陷，也真是心疼貂蝉妹子，想这貂蝉本就是一枚棋子，结果假戏成真，可谓性情中人。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21061", "36101", "36101", "218", },
    id_10813 = {"要说这荀彧和郭嘉料想吕布武力惊人，但也就是一介武夫，对军事和整军完全不在行，所以才按兵不动，等待吕布认输举旗。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21062", "36101", "36101", "218", },
    id_10814 = {"又过了一个月，下邳上下满面死灰了，吕布的副将也已经按耐不住了……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21063", "36105", "36105", "218", },
    id_10815 = {"一代英杰就此陨落，小白楼上枭首示众，虽然吕布武功盖世，但是也难敌荀彧和郭嘉两位谋士的计策，临了还被刘备脏了一波，当真是令人唏嘘啊！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21061", "21063", "36005", "218", },
    id_10901 = {"听闻曹老板请我们刘皇叔吃饭喝酒聊天，曹老板突然如此雅兴，不禁让别人猜疑~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21072", "36101", "36101", "218", },
    id_10902 = {"两位以后叱咤风云的大人物，就依亭而坐，备好樽俎，开怀畅饮，不禁让人有些莫名的感伤，感伤造化命运。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21073", "36105", "36105", "218", },
    id_10903 = {"荀彧此人真是建树颇多，又是举人，又是献计，为曹操所重用，还被曹操尊称：吾之乳房~~~哦不对……是无之子房！！（羞羞……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21074", "36101", "36101", "218", },
    id_10904 = {"许褚左右护卫曹老板，也是位艺高人胆大的猛将啊，听说小时候就人高马大，出生更有说10来斤！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21071", "36105", "36105", "218", },
    id_10905 = {"许褚人高马大，一副标准的傻大憨，不过就是横眉怒目的有点吓人，难道是张飞失散多年的亲姐妹么~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21072", "36101", "36101", "218", },
    id_10906 = {"许褚可真是一等一的力气大，那力气放到现在当真可赢个什么世界大力士比赛，不过也是身体大脑仁小的典型代表，智商是硬伤。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21073", "36105", "36105", "218", },
    id_10907 = {"张辽原本也是吕布手下的八健将，不过算是天资很高的，从吕布那也学了不少好东西！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21074", "36101", "36101", "218", },
    id_10908 = {"自从吕布被小白楼斩首后，张辽见机立马投入曹老板的怀抱，俩人眉来眼去最后也促成了很多的事~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21071", "36105", "36105", "218", },
    id_10909 = {"张辽从在吕布手下勤勤恳恳到最后成为曹营第一将，整条事件线都可以拍成张辽升职记了！~简直就是职场教科书啊！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21072", "36105", "36105", "218", },
    id_10910 = {"“愿我们有歌有酒有女人，从此浪迹天涯”这台词说出来两人皆是面红耳赤啊……不对，剧本拿错了……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21073", "36105", "36105", "218", },
    id_10911 = {"两位以后叱咤风云的大人物，就依亭而坐，备好樽俎，开怀畅饮，不禁让人有些莫名的感伤，感伤造化命运。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21074", "36101", "36101", "218", },
    id_10912 = {"曹操这句天下英雄实属试探，高~果真是乱世奸雄，这一问，刘皇叔的心要跳出嗓子眼了！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21071", "36105", "36105", "218", },
    id_10913 = {"我们刘皇叔明知道这是个什么性质的局，而且关二姐和张三妹不在身边，只身赴宴，此等胆量也是惊人。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21072", "36101", "36101", "218", },
    id_10914 = {"眼看这天是要乌云密布了，话题也越聊越深刻，天下英雄也越聊越少，也越聊越劈……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21073", "36105", "36105", "218", },
    id_10915 = {"机智如我刘皇叔，借着这声雷，硬是把曹操老儿蒙住了~不过此地不宜久留，还是劝刘皇叔早些跑路吧~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21071", "21073", "36025", "218", },
    id_11001 = {"想说这刘皇叔跑的也是够仓促的，啥也没准备即刻赶路，日夜兼程，也依旧不得脱身……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21072", "36102", "36102", "218", },
    id_11002 = {"想说这刘皇叔跑的也是够仓促的，啥也没准备即刻赶路，日夜兼程，也依旧不得脱身……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21073", "36105", "36105", "218", },
    id_11003 = {"朱灵虽然最后位居将军，也只是因为其跟随时间久，由于他旧背景和主动投叛，所以曹老板估计也不是很待见他。整个一个魏国最佳第六人……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21074", "36102", "36102", "218", },
    id_11004 = {"郭嘉自幼体弱多病，曾经被神医华佗治疗，虽说身体孱弱，但是心智却在三国所有智将里数一数二。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21071", "36102", "36102", "218", },
    id_11005 = {"传闻郭嘉善观天象，放到现在可以直接荣升气象局局长了~也是了得啊。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21072", "36105", "36105", "218", },
    id_11006 = {"虽然这郭嘉看透刘备，但是鉴于杀了刘备将招致天下贤士的恶名，所以劝曹老板放弃追杀，不过这也成了曹操集团最大的祸患。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21073", "36101", "36101", "218", },
    id_11007 = {"喝了顿酒，结果招致杀身之祸，我们大皇叔到底是造了什么孽啊~这相爱相杀的剧情到底是闹怎样~？", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21074", "36101", "36101", "218", },
    id_11008 = {"虽然表面是曹老板和皇叔相爱相杀，但是我觉得曹老板肯定还是更爱关二姐哒~~么么哒~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21071", "36105", "36105", "218", },
    id_11009 = {"程昱是极力主见杀了刘备之人，当时曹老板也是为了一些面子事结果就没痛下杀手，后来毁的肠子都青了……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21072", "36101", "36101", "218", },
    id_11010 = {"刘备也是慌不择路，来到徐州，正巧徐州刺史车胄奉命要来取皇叔姓名……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21073", "36105", "36105", "218", },
    id_11011 = {"关二哥献计假扮曹军引胄出迎，结果月黑风高的……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21074", "36101", "36101", "218", },
    id_11012 = {"这车胄也是够背的，赶上我们刘皇叔这跑路杀人不眨眼的，也真是活该摊上事了。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21071", "36105", "36105", "218", },
    id_11013 = {"本来曹老板是要斩了那朱灵，结果荀彧求情，赦免了朱灵等人，又派其去堵截刘备一行。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21072", "36101", "36101", "218", },
    id_11014 = {"不过荀彧还是没有料到，刘备好歹也是世之枭雄，哪可能惨死在一届叛将之手。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21073", "36105", "36105", "218", },
    id_11015 = {"荀彧一生夙愿便是让大汉王朝延续下去，最终也是服毒含冤而死，令人叹息不已，不过这刘皇叔这次是四散而逃了，我还是得帮助他一下~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21071", "21073", "36025", "218", },
    id_11101 = {"刘皇叔逃从下邳逃至小沛，已是筋疲力尽，殊不知曹军正在等候他。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21072", "36105", "36105", "218", },
    id_11102 = {"刘皇叔逃从下邳逃至小沛，已是筋疲力尽，殊不知曹军正在等候他。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21073", "36101", "36101", "218", },
    id_11103 = {"曹老板虽然明面上是追杀想取代自己的刘皇叔，不过实质是垂涎关二姐很久了~~口水都流了一枕头了~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21074", "36101", "36101", "218", },
    id_11104 = {"刘皇叔跑到小沛，起兵反曹，这勇气真也是没谁了，不过他联系了袁绍这个鸡贼王中王，实在是……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21071", "36101", "36101", "218", },
    id_11105 = {"刘皇叔跑到小沛，起兵反曹，这勇气真也是没谁了，不过他联系了袁绍这个鸡贼王中王，实在是……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21072", "36105", "36105", "218", },
    id_11106 = {"徐晃虽然原是董胖子的人，不过这攻陷小沛可算是令曹老板刮目相看了。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21073", "36101", "36101", "218", },
    id_11107 = {"虽然袁绍这人太鸡贼，但是他如果真的不派兵帮助刘备，最后的官渡之战更加难打。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21074", "36101", "36101", "218", },
    id_11108 = {"虽然袁绍这人太鸡贼，但是他如果真的不派兵帮助刘备，最后的官渡之战更加难打。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21071", "36101", "36101", "218", },
    id_11109 = {"许褚作为曹老板的贴身护卫，仿佛整个灵魂都与曹老板有交集，预知灾祸，这俩人不是干了什么不正经的事吧……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21072", "36101", "36101", "218", },
    id_11110 = {"曹操之前为了平定吕布也是煞费苦心，这下刘皇叔又起兵造反，曹老板的业务链也有点太广了。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21073", "36101", "36101", "218", },
    id_11111 = {"曹操之前为了平定吕布也是煞费苦心，这下刘皇叔又起兵造反，曹老板的业务链也有点太广了。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21074", "36101", "36101", "218", },
    id_11112 = {"夏侯将军这眼睛也吃了，眼罩也戴了，传闻这千里眼被射烂了，整个人都不好了~~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21071", "36101", "36101", "218", },
    id_11113 = {"张辽之前也和皇叔有过几面孽缘，所以其实对皇叔也有点怀恨在心，这次正好可以趁火打劫一下~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21072", "36101", "36101", "218", },
    id_11114 = {"张辽之前也和皇叔有过几面孽缘，所以其实对皇叔也有点怀恨在心，这次正好可以趁火打劫一下~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21073", "36101", "36101", "218", },
    id_11115 = {"张辽跟随吕布也多年，自小武艺精通，不愧是曹操集团的第一猛将！曾经打的孙权屁滚尿流，也当真是小战神了！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21071", "21073", "36036", "218", },
    id_11201 = {"关二姐这次被迫降于曹老板，也是为了报答曹老板的厚待。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21112", "36101", "36101", "218", },
    id_11202 = {"关二姐这次被迫降于曹老板，也是为了报答曹老板的厚待。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21113", "36105", "36105", "218", },
    id_11203 = {"颜良和文丑作为袁绍军主力将也就算个二三流选手，也就和许褚典韦打个上下，碰上我们关二爷简直不堪一击。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21114", "36101", "36101", "218", },
    id_11204 = {"曹老板敬慕关二姐的忠诚仁义，也不许部将对其追赶，但是还是有很多人拦路。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21111", "36101", "36101", "218", },
    id_11205 = {"曹老板敬慕关二姐的忠诚仁义，也不许部将对其追赶，但是还是有很多人拦路。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21112", "36101", "36101", "218", },
    id_11206 = {"文丑这哥们刚说跟徐晃玩了三十个回合，休息休息，结果又碰上了一个跑路达人……后果就是……再见……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21113", "36101", "36101", "218", },
    id_11207 = {"斩了文丑，关二姐本来是想管刘延借搜船渡河，谁想这刘延吃了关二姐十大坛子的醋，死活也不借……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21114", "36105", "36105", "218", },
    id_11208 = {"斩了文丑，关二姐本来是想管刘延借搜船渡河，谁想这刘延吃了关二姐十大坛子的醋，死活也不借……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21111", "36101", "36101", "218", },
    id_11209 = {"虽说刘延吃醋，但是人家带兵打仗还是有一套的，被颜良射了肩膀还能坚持指挥作战，也是鞠躬尽瘁了！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21112", "36105", "36105", "218", },
    id_11210 = {"关二爷姐吃了刘延的老陈醋牌闭船羹，气的直跳脚骂街，不过也没办法，毕竟人家曹老板对自己不错……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21113", "36101", "36101", "218", },
    id_11211 = {"关二爷姐吃了刘延的老陈醋牌闭船羹，气的直跳脚骂街，不过也没办法，毕竟人家曹老板对自己不错……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21114", "36105", "36105", "218", },
    id_11212 = {"这魏续看着宋宪被撸，自己也迫不及待的想去亲自体验，结果刚上场3秒就被颜良秒杀了……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21111", "36101", "36101", "218", },
    id_11213 = {"关二姐到处寻船，带领着刘皇叔一众被掳走的家眷，穿梭在战火纷飞的混乱中……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21112", "36101", "36101", "218", },
    id_11214 = {"关二姐到处寻船，带领着刘皇叔一众被掳走的家眷，穿梭在战火纷飞的混乱中……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21113", "36101", "36101", "218", },
    id_11215 = {"徐晃在白马可是神挡杀神佛挡杀佛，这一场解围之战是徐晃名扬之所，破颜良，挡文丑，战功显赫！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21111", "21113", "36028", "218", },
    id_11301 = {"话说这关二姐走的匆忙啥也没带，卷着各种嫂嫂来一场说走就走的旅行~~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21112", "36105", "36105", "218", },
    id_11302 = {"话说这关二姐走的匆忙啥也没带，卷着各种嫂嫂来一场说走就走的旅行~~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21113", "36101", "36101", "218", },
    id_11303 = {"本来放关二姐走是曹老板一直的意思，结果这孔秀不知道哪来的雄心豹子胆，敢以无文凭为由阻拦，抽的你妈都不认识你！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21114", "36105", "36105", "218", },
    id_11304 = {"关二姐三下五除二就把孔秀这个不知天高地厚的干翻了，直奔下一个地点，洛阳城……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21111", "36101", "36101", "218", },
    id_11305 = {"关二姐三下五除二就把孔秀这个不知天高地厚的干翻了，直奔下一个地点，洛阳城……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21112", "36101", "36101", "218", },
    id_11306 = {"都看到自己牙将孟坦被关二姐秒了，还过来寻仇，真是杀一送一啊，没那个实力就别出来送死好不好~！~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21113", "36105", "36105", "218", },
    id_11307 = {"干翻了上述的俩废柴之后，关二姐来到镇国寺，准备安顿一下，顺便修养之前的箭伤……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21114", "36101", "36101", "218", },
    id_11308 = {"干翻了上述的俩废柴之后，关二姐来到镇国寺，准备安顿一下，顺便修养之前的箭伤……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21111", "36105", "36105", "218", },
    id_11309 = {"卞喜，原为黄巾贼，后来在镇国寺埋伏为杀关二姐，我特别想说，曹老板手底下这些智商低下的人都是哪来的……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21112", "36101", "36101", "218", },
    id_11310 = {"辞别了寺庙主持一行人，关二姐来到了第四关，一路上关二姐旅途劳累寻了个小旅馆准备稍作休息……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21113", "36105", "36105", "218", },
    id_11311 = {"辞别了寺庙主持一行人，关二姐来到了第四关，一路上关二姐旅途劳累寻了个小旅馆准备稍作休息……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21114", "36101", "36101", "218", },
    id_11312 = {"这王植想得美，这荒郊野村的哪平白无故就出来一个小旅馆，傻子都能看出来，这简直就是曹操集团的智商底线啊！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21111", "36105", "36105", "218", },
    id_11313 = {"终于快到渡口了~关二姐也快松了一口气，不过看对方架势，也是免不了一场死战，但是胜利就在眼前了，大姐~~我来了~~~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21112", "36105", "36105", "218", },
    id_11314 = {"终于快到渡口了~关二姐也快松了一口气，不过看对方架势，也是免不了一场死战，但是胜利就在眼前了，大姐~~我来了~~~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21113", "36101", "36101", "218", },
    id_11315 = {"秦琪本来还特别不忿儿的说关二姐有名无功，非要比一比~比就比~谁怕谁谁怕谁~走好不送~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21111", "21113", "36030", "218", },
    id_11401 = {"过了黄河，马不停蹄的立即前往之前与皇叔约定的地方，关二姐的心情也放松了许多……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21112", "36101", "36101", "218", },
    id_11402 = {"过了黄河，马不停蹄的立即前往之前与皇叔约定的地方，关二姐的心情也放松了许多……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21113", "36105", "36105", "218", },
    id_11403 = {"周仓自打遇见关二姐，就开始瞬间路转粉，粉的死去活来的，扛刀扛包的，这哪是粉丝，这就是一奴隶~~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21114", "36101", "36101", "218", },
    id_11404 = {"几人一边闲聊一边走，却撞见正在城外赏花的文臣简雍，简雍见二姐喜出望外，赶紧迎上前去……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21111", "36101", "36101", "218", },
    id_11405 = {"几人一边闲聊一边走，却撞见正在城外赏花的文臣简雍，简雍见二姐喜出望外，赶紧迎上前去……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21112", "36101", "36101", "218", },
    id_11406 = {"简雍和皇叔是发小，俩人一起搞过很多次飞……哦不对，俩人小时候到处游历山河，这也是刘备集团为数不多的智囊~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21113", "36101", "36101", "218", },
    id_11407 = {"关平见到许久未见的老爹，当然是想表现一下自己最近的进步，所以抄着刀就过来了…这阵势也是够吓了二姐一跳……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21114", "36105", "36105", "218", },
    id_11408 = {"关平见到许久未见的老爹，当然是想表现一下自己最近的进步，所以抄着刀就过来了…这阵势也是够吓了二姐一跳……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21111", "36105", "36105", "218", },
    id_11409 = {"关二姐的私生子，但传闻他是充话费送的，不知道是哪家运营商这么给力……给我也来一个被~~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21112", "36101", "36101", "218", },
    id_11410 = {"赵云得知关羽回来，就自告奋勇的上前迎接，同时看到两位嫂子也平安无事，心中对关二姐无限敬佩。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21113", "36105", "36105", "218", },
    id_11411 = {"赵云得知关羽回来，就自告奋勇的上前迎接，同时看到两位嫂子也平安无事，心中对关二姐无限敬佩。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21114", "36105", "36105", "218", },
    id_11412 = {"常山赵子龙，之前一直跟随公孙瓒，在其主被杀后，转投刘皇叔，俩人在几次相遇时惺惺相惜，现在已经各种姐妹淘走起来了~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21111", "36105", "36105", "218", },
    id_11413 = {"由于关二姐是偷偷回的娘家，导致娘家人都不清楚状况，这张三妹气的说谁敢冒充我二姐，我戳死他！~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21112", "36101", "36101", "218", },
    id_11414 = {"由于关二姐是偷偷回的娘家，导致娘家人都不清楚状况，这张三妹气的说谁敢冒充我二姐，我戳死他！~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21113", "36101", "36101", "218", },
    id_11415 = {"跋山涉水~三姐妹终于想见，三人一起又抱又哭的，不愧是乱世的桃园三姐妹，感情深厚可见一斑了。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21111", "21113", "36043", "218", },
    id_11501 = {"关二姐终于和刘皇叔汇合，我们把目光聚焦在江东一带。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21122", "36101", "36101", "218", },
    id_11502 = {"江东小霸王孙策，为了老爹孙坚的遗愿，自甘屈膝于袁术手下，无薪尝胆啊。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21123", "36105", "36105", "218", },
    id_11503 = {"许贡这小bitch，给曹老板打小报告还被孙策发现了，孙策哪舍得将自己打下的江东拱手让操，直接就处死了许贡。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21124", "36101", "36101", "218", },
    id_11504 = {"其实袁术也不是什么好鸟，知道这江东小霸王怎可自屈在自己身下，所以一直想搞死孙策，只是苦于何从下手。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21121", "36105", "36105", "218", },
    id_11505 = {"其实袁术也不是什么好鸟，知道这江东小霸王怎可自屈在自己身下，所以一直想搞死孙策，只是苦于何从下手。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21122", "36101", "36101", "218", },
    id_11506 = {"程公可是将毕生都先给了东吴，历经孙坚，孙策，孙权三代，可谓真是忠臣猛将，给程老爷子鞠躬了。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21123", "36101", "36101", "218", },
    id_11507 = {"于吉利用宗教获得人心，但是却忘记了，一旦宗教寒冬了世俗的诠释，那将是宗教的灭顶之灾。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21124", "36105", "36105", "218", },
    id_11508 = {"于吉利用宗教获得人心，但是却忘记了，一旦宗教寒冬了世俗的诠释，那将是宗教的灭顶之灾。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21121", "36101", "36101", "218", },
    id_11509 = {"虽说成天装疯卖傻，但是人家好歹也是得了真传，小策策俱其妖言惑众，就找个法子给于老爷子办了，哎，招谁惹谁了……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21122", "36105", "36105", "218", },
    id_11510 = {"孙策虽说是一代名将，但是也真是天妒英才，不管武力谋略，都可以说一等一，就是架不住身边总有小人……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21123", "36101", "36101", "218", },
    id_11511 = {"孙策虽说是一代名将，但是也真是天妒英才，不管武力谋略，都可以说一等一，就是架不住身边总有小人……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21124", "36105", "36105", "218", },
    id_11512 = {"历史相传，说是孙策杀了于吉，于吉人家可是老仙人，你杀了仙人，那你自己也要受到万劫不复的诅咒！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21121", "36105", "36105", "218", },
    id_11513 = {"大名鼎鼎的东吴大王出现啦，虽然当下死了哥，但是往后他将驰骋于这广阔的历史舞台上！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21122", "36105", "36105", "218", },
    id_11514 = {"大名鼎鼎的东吴大王出现啦，虽然当下死了哥，但是往后他将驰骋于这广阔的历史舞台上！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21123", "36102", "36102", "218", },
    id_11515 = {"孙权可谓是名门之后，相传他孙家兵法的22代传人，自小文武双全，又随父兄征战，真是天降神才啊！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21121", "21123", "36043", "218", },
    id_11601 = {"曹老板刚纳了关二姐，就立马开始对袁老板发起最后的总攻，这是预先知道二姐会逃婚么！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21122", "36105", "36105", "218", },
    id_11602 = {"曹老板刚纳了关二姐，就立马开始对袁老板发起最后的总攻，这是预先知道二姐会逃婚么！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21123", "36101", "36101", "218", },
    id_11603 = {"听说曹洪这人扣的要死，曹丕管他借钱，他连100块都不给，这是怎么当叔叔的！难怪曹丕这么恨他呢~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21124", "36101", "36101", "218", },
    id_11604 = {"在官渡僵持阶段，就看谁能出其不意攻其不备，曹老板在这方面真是有如胜利女神眷顾啊。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21121", "36105", "36105", "218", },
    id_11605 = {"在官渡僵持阶段，就看谁能出其不意攻其不备，曹老板在这方面真是有如胜利女神眷顾啊。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21122", "36105", "36105", "218", },
    id_11606 = {"史涣和徐晃两人被安排了去截获袁绍的粮草车，俩人在路边抽烟，徐晃随手弹了个烟头，粮草车就全着了……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21123", "36101", "36101", "218", },
    id_11607 = {"刚刚史涣才和循环俩人配着烟聊了会心里话，就被曹仁叫走继续冒烟去了~~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21124", "36101", "36101", "218", },
    id_11608 = {"刚刚史涣才和循环俩人配着烟聊了会心里话，就被曹仁叫走继续冒烟去了~~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21121", "36105", "36105", "218", },
    id_11609 = {"恩，结果也是显而易见的，又一个不小心把袁绍的粮草车给……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21122", "36105", "36105", "218", },
    id_11610 = {"眼看着这一车一车的粮草被烤成黑炭，心里好心疼这一车车的大白米饭啊~~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21123", "36105", "36105", "218", },
    id_11611 = {"眼看着这一车一车的粮草被烤成黑炭，心里好心疼这一车车的大白米饭啊~~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21124", "36105", "36105", "218", },
    id_11612 = {"也许你们不明白，为啥曹仁，史涣，徐晃三人一抽烟就烧辆车呢，因为许攸这个反水帝全部透露了辆车的位置……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21121", "36101", "36101", "218", },
    id_11613 = {"结果已经明了，曹操集团已经占据了大部分的主动权，北方大陆嫣然已经尽收曹营了！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21122", "36105", "36105", "218", },
    id_11614 = {"结果已经明了，曹操集团已经占据了大部分的主动权，北方大陆嫣然已经尽收曹营了！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21123", "36105", "36105", "218", },
    id_11615 = {"曹老板真是坐等胜利的果实，自己也没想到，官渡之战，不仅壮大自己，更称霸整个北方大陆。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21121", "21123", "36009", "218", },
    id_11701 = {"看完了曹老板的胜券在握，再来去看看袁绍老儿的损色吧！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21122", "36105", "36105", "218", },
    id_11702 = {"看完了曹老板的胜券在握，再来去看看袁绍老儿的损色吧！", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21123", "36101", "36101", "218", },
    id_11703 = {"张郃曾经是袁绍手下一员大将，帮助袁绍击败了强敌公孙瓒，不过后来因为小人郭图不得不得投靠曹老板，当然，结局是在三国大陆上闪耀了自己。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21124", "36105", "36105", "218", },
    id_11704 = {"袁绍的谋士不多，而且小坏包也不少，但是沮授难得的算是一个对袁绍忠心耿耿的谋才。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21121", "36101", "36101", "218", },
    id_11705 = {"袁绍的谋士不多，而且小坏包也不少，但是沮授难得的算是一个对袁绍忠心耿耿的谋才。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21122", "36105", "36105", "218", },
    id_11706 = {"曹老板爱了沮授这么久，结果还是被发了好人卡，好替曹老板桑心那，沮授你就从了老夫吧~", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21123", "36101", "36101", "218", },
    id_11707 = {"话说这高览和张三妹，也有一段战地姻缘，两人一个取敌将，一个护主，结果就在交锋时变得惺惺相惜，也是一段佳话…………", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21124", "36101", "36101", "218", },
    id_11708 = {"话说这高览和张三妹，也有一段战地姻缘，两人一个取敌将，一个护主，结果就在交锋时变得惺惺相惜，也是一段佳话…………", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21121", "36105", "36105", "218", },
    id_11709 = {"高览和张郃真是难兄难弟啊，同样被郭图坑了，然后跟着张郃一起投奔了曹老板，不过这位仁兄也是被赵云秒杀的货。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21122", "36105", "36105", "218", },
    id_11710 = {"早在之前，田丰就劝袁绍趁火打劫，趁着曹老板攻打刘皇叔，抄后院，结果袁绍这个爱子心切啊，孩子病了，不能出征，活该袁绍会输的那么惨……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_1", "21123", "36101", "36101", "218", },
    id_11711 = {"早在之前，田丰就劝袁绍趁火打劫，趁着曹老板攻打刘皇叔，抄后院，结果袁绍这个爱子心切啊，孩子病了，不能出征，活该袁绍会输的那么惨……", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21124", "36105", "36105", "218", },
    id_11712 = {"田丰也是惨啊，碰到的昏君不说，还碰到个暴君，如果袁老板早点抄了曹老板后院，也不至于在官渡上大败于曹操。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_5", "21121", "36101", "36101", "218", },
    id_11713 = {"袁绍这几个儿子也不咋地，为了父上那点地位各个抢着争权，袁谭更绝，和曹老板一起piapia抽自己弟弟，可谓心狠手辣之人啊。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_4", "21122", "36101", "36101", "218", },
    id_11714 = {"袁绍这几个儿子也不咋地，为了父上那点地位各个抢着争权，袁谭更绝，和曹老板一起piapia抽自己弟弟，可谓心狠手辣之人啊。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_3", "21123", "36101", "36101", "218", },
    id_11715 = {"袁绍这人，为人多疑，所以每每错过重要的反攻或者进攻时机，这也是袁绍在官渡大败的原因，我们的三国历史还在继续，后面还有更精彩的内容。", "POS_1_2", "POS_1_3", "POS_2_2", "POS_2_5", "POS_3_2", "21121", "21123", "36036", "218", },
    id_20101 = {"风萧萧兮易水寒，壮士一去兮不复还。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_2", "1021", "1022", "1023", "36005", },
    id_20102 = {"桃李不言，下自成蹊。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_1", "1031", "1032", "1033", "36011", },
    id_20103 = {"燕雀安知鸿鹄之志哉。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_1", "1031", "1032", "1033", "36011", },
    id_20104 = {"运筹帷幄之中，决胜千里之外。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_5", "21061", "21062", "21063", "36030", },
    id_20105 = {"忠言逆耳利于行，良药苦口利于病。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_1", "21061", "21062", "21063", "36009", },
    id_20106 = {"人固有一死，或重于泰山，或轻于鸿毛。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_2", "21061", "21062", "21063", "36005", },
    id_20107 = {"智者千虑，必有一失；愚者千虑，必有一得。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_1", "21071", "21072", "21073", "36025", },
    id_20108 = {"绳锯木断，水滴石穿。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_1", "21071", "21072", "21073", "36025", },
    id_20109 = {"若要人不知，除非己莫为。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_2", "21071", "21072", "21073", "36036", },
    id_20110 = {"少壮不努力，老大徒伤悲。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_2", "21111", "21112", "21113", "36028", },
    id_20111 = {"疾风知劲草，岁寒见后凋。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_5", "21111", "21112", "21113", "36030", },
    id_20112 = {"失之东隅，收之桑榆。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_1", "21111", "21112", "21113", "36043", },
    id_20113 = {"精诚所至，金石为开。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_1", "21121", "21122", "21123", "36043", },
    id_20114 = {"贫贱之知不可忘，糟糠之妻不下堂。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_1", "21121", "21122", "21123", "36009", },
    id_20115 = {"志士不饮盗泉之水，廉者不受嗟来之食。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_2", "21121", "21122", "21123", "36036", },
    id_30101 = {"老骥伏枥，志在千里；烈士暮年，壮心不已。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "205", "203", "205", "203", },
    id_30102 = {"山不厌高，海不厌深；周公吐哺，天下归心。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "205", "203", "205", "203", },
    id_30103 = {"非学无以广才，非志无以成学。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "205", "203", "205", "203", },
    id_30104 = {"非淡泊无以明志，非宁静无以致远。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "205", "203", "205", "203", },
    id_30105 = {"勿以恶小而为之，勿以善小而不为。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "205", "203", "205", "203", },
    id_30106 = {"国以民为本，民以食为天。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "205", "203", "205", "203", },
    id_30107 = {"盛年不重来，一日难再晨。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "205", "203", "205", "203", },
    id_30108 = {"不戚戚于贫贱，不汲汲于富贵。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "205", "203", "205", "203", },
    id_30201 = {"一年之计在于春，一日之计在于晨。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "208", "209", "208", "209", },
    id_30202 = {"宁为玉碎，不为瓦全。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "208", "209", "208", "209", },
    id_30203 = {"当局者迷，旁观者清。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "208", "209", "208", "209", },
    id_30204 = {"疾风知劲草，板荡识诚臣。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "208", "209", "208", "209", },
    id_30205 = {"海内存知己，天涯若比邻。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "208", "209", "208", "209", },
    id_30206 = {"欲穷千里目，更上一层楼。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "208", "209", "208", "209", },
    id_30207 = {"黄沙百战穿金甲，不破楼兰终不还。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "208", "209", "208", "209", },
    id_30208 = {"清水出芙蓉，天然去雕饰。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "208", "209", "208", "209", },
    id_30301 = {"大鹏一日同风起，扶摇直上九万里。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "4200", "4199", "4200", "4199", },
    id_30302 = {"俱怀逸兴壮思飞，欲上青天揽明月。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "4200", "4199", "4200", "4199", },
    id_30303 = {"仰天大笑出门去，我辈岂是蓬蒿人。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "4200", "4199", "4200", "4199", },
    id_30304 = {"天生我材必有用，千金散尽还复来。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "4200", "4199", "4200", "4199", },
    id_30305 = {"长风破浪会有时，直挂云帆济沧海。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "4200", "4199", "4200", "4199", },
    id_30306 = {"兴酣落笔摇五岳，诗成笑傲凌沧海。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "4200", "4199", "4200", "4199", },
    id_30307 = {"安能摧眉折腰事权贵，使我不得开心颜。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "4200", "4199", "4200", "4199", },
    id_30308 = {"读书破万卷，下笔如有神。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "4200", "4199", "4200", "4199", },
    id_30401 = {"会当凌绝顶，一览众山小。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "3200", "3199", "3200", "3199", },
    id_30402 = {"笔落惊风雨，诗成泣鬼神。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "3200", "3199", "3200", "3199", },
    id_30403 = {"新松恨不高千尺，恶竹应须斩万竿。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "3200", "3199", "3200", "3199", },
    id_30404 = {"尔曹身与名俱灭，不废江河万古流。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "3200", "3199", "3200", "3199", },
    id_30405 = {"今夜月明人尽望，不知愁思落谁家。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "3200", "3199", "3200", "3199", },
    id_30406 = {"谁言寸草心，报得三春晖。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "3200", "3199", "3200", "3199", },
    id_30407 = {"大凡物不得其平则鸣。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "3200", "3199", "3200", "3199", },
    id_30408 = {"蚍蜉撼大树，可笑不自量。", "POS_1_2", "POS_1_5", "POS_2_2", "POS_2_5", "POS_3_3", "3200", "3199", "3200", "3199", },
    id_50101 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "219", "301", "301", "301", },
    id_50102 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_4", "POS_1_3", "POS_1_1", "POS_1_2", "219", "301", "301", "301", },
    id_50103 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_1", "219", "302", "302", "302", },
    id_50104 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_2", "219", "302", "302", "302", },
    id_50105 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_3", "222", "301", "302", "303", },
    id_50106 = {"无武将阵亡，允许进入下一层！", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_5", "219", "304", "304", "304", },
    id_50107 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_4", "219", "304", "304", "304", },
    id_50108 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_2", "219", "305", "305", "305", },
    id_50109 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_2", "219", "305", "305", "305", },
    id_50110 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_1", "222", "304", "305", "306", },
    id_50111 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_4", "POS_1_2", "POS_1_1", "POS_1_3", "219", "307", "307", "307", },
    id_50112 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_4", "219", "307", "307", "307", },
    id_50113 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_2", "219", "308", "308", "308", },
    id_50114 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_1", "219", "308", "308", "308", },
    id_50115 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_5", "222", "307", "308", "309", },
    id_50201 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_4", "POS_1_2", "POS_1_1", "POS_1_3", "219", "311", "311", "311", },
    id_50202 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "219", "311", "311", "311", },
    id_50203 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_1", "219", "312", "312", "312", },
    id_50204 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_1", "219", "312", "312", "312", },
    id_50205 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_2", "222", "311", "312", "313", },
    id_50206 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_4", "POS_1_2", "POS_1_1", "POS_1_3", "219", "314", "314", "314", },
    id_50207 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_4", "219", "314", "314", "314", },
    id_50208 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_2", "219", "315", "315", "315", },
    id_50209 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_1", "219", "315", "315", "315", },
    id_50210 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_2", "222", "314", "315", "316", },
    id_50211 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_4", "219", "317", "317", "317", },
    id_50212 = {"无武将阵亡，允许进入下一层！", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_5", "219", "317", "317", "317", },
    id_50213 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_3", "219", "318", "318", "318", },
    id_50214 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_2", "219", "318", "318", "318", },
    id_50215 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_1", "222", "317", "318", "319", },
    id_50301 = {"无武将阵亡，允许进入下一层！", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_5", "219", "321", "321", "321", },
    id_50302 = {"无武将阵亡，允许进入下一层！", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_5", "219", "321", "321", "321", },
    id_50303 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_4", "219", "322", "322", "322", },
    id_50304 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_3", "219", "322", "322", "322", },
    id_50305 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_1", "222", "321", "322", "323", },
    id_50306 = {"无武将阵亡，允许进入下一层！", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_5", "219", "324", "324", "324", },
    id_50307 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_4", "POS_1_2", "POS_1_1", "POS_1_3", "219", "324", "324", "324", },
    id_50308 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_2", "219", "325", "325", "325", },
    id_50309 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_4", "219", "325", "325", "325", },
    id_50310 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_2", "222", "324", "325", "326", },
    id_50311 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_4", "POS_1_2", "POS_1_1", "POS_1_3", "219", "327", "327", "327", },
    id_50312 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_4", "219", "327", "327", "327", },
    id_50313 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_3", "219", "328", "328", "328", },
    id_50314 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_4", "219", "328", "328", "328", },
    id_50315 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_4", "222", "327", "328", "329", },
    id_50401 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_4", "POS_1_2", "POS_1_1", "POS_1_3", "219", "331", "331", "331", },
    id_50402 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_4", "POS_1_3", "POS_1_1", "POS_1_2", "219", "331", "331", "331", },
    id_50403 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_4", "219", "332", "332", "332", },
    id_50404 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_1", "219", "332", "332", "332", },
    id_50405 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_3", "222", "331", "332", "333", },
    id_50406 = {"无武将阵亡，允许进入下一层！", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_5", "219", "334", "334", "334", },
    id_50407 = {"无武将阵亡，允许进入下一层！", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_5", "219", "334", "334", "334", },
    id_50408 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_1", "219", "335", "335", "335", },
    id_50409 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_2", "219", "335", "335", "335", },
    id_50410 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_2", "222", "334", "335", "336", },
    id_50411 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "219", "337", "337", "337", },
    id_50412 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_4", "POS_1_2", "POS_1_1", "POS_1_3", "219", "337", "337", "337", },
    id_50413 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_2", "219", "338", "338", "338", },
    id_50414 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_3", "219", "338", "338", "338", },
    id_50415 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_1", "222", "337", "338", "339", },
    id_50501 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_4", "POS_1_2", "POS_1_1", "POS_1_3", "219", "341", "341", "341", },
    id_50502 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_4", "219", "341", "341", "341", },
    id_50503 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_2", "219", "342", "342", "342", },
    id_50504 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_1", "219", "342", "342", "342", },
    id_50505 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_4", "222", "341", "342", "343", },
    id_50506 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_4", "219", "344", "344", "344", },
    id_50507 = {"无武将阵亡，允许进入下一层！", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_5", "219", "344", "344", "344", },
    id_50508 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_3", "219", "345", "345", "345", },
    id_50509 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_2", "219", "345", "345", "345", },
    id_50510 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_5", "222", "344", "345", "346", },
    id_50511 = {"无武将阵亡，允许进入下一层！", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_5", "219", "347", "347", "347", },
    id_50512 = {"无武将阵亡，允许进入下一层！", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_5", "219", "347", "347", "347", },
    id_50513 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_4", "219", "348", "348", "348", },
    id_50514 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_3", "219", "348", "348", "348", },
    id_50515 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_5", "222", "347", "348", "349", },
    id_50601 = {"无武将阵亡，允许进入下一层！", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_5", "219", "351", "351", "351", },
    id_50602 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_4", "POS_1_2", "POS_1_1", "POS_1_3", "219", "351", "351", "351", },
    id_50603 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_2", "219", "352", "352", "352", },
    id_50604 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_4", "219", "352", "352", "352", },
    id_50605 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_4", "222", "351", "352", "353", },
    id_50606 = {"无武将阵亡，允许进入下一层！", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_5", "219", "354", "354", "354", },
    id_50607 = {"无武将阵亡，允许进入下一层！", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_5", "219", "354", "354", "354", },
    id_50608 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_5", "219", "355", "355", "355", },
    id_50609 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_5", "219", "355", "355", "355", },
    id_50610 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_3", "222", "354", "355", "356", },
    id_50611 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "219", "357", "357", "357", },
    id_50612 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "219", "357", "357", "357", },
    id_50613 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_5", "219", "358", "358", "358", },
    id_50614 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_3", "219", "358", "358", "358", },
    id_50615 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_1", "222", "357", "358", "359", },
    id_50701 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_4", "219", "361", "361", "361", },
    id_50702 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_4", "POS_1_2", "POS_1_1", "POS_1_3", "219", "361", "361", "361", },
    id_50703 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_3", "219", "362", "362", "362", },
    id_50704 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_4", "219", "362", "362", "362", },
    id_50705 = {"无武将阵亡，允许进入下一层！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_5", "222", "361", "362", "363", },
    id_50706 = {"无武将阵亡，允许进入下一层！", "POS_1_5", "POS_1_4", "POS_1_3", "POS_1_1", "POS_1_2", "219", "364", "364", "364", },
    id_50707 = {"无武将阵亡，允许进入下一层！", "POS_1_4", "POS_1_3", "POS_1_2", "POS_1_1", "POS_1_5", "219", "364", "364", "364", },
    id_50708 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_4", "219", "365", "365", "365", },
    id_50709 = {"无武将阵亡，允许进入下一层！", "POS_1_2", "POS_1_3", "POS_1_4", "POS_1_5", "POS_2_5", "219", "365", "365", "365", },
    id_50710 = {"当你看到我，说明你距离巅峰只有一步之遥！", "POS_1_3", "POS_1_5", "POS_2_3", "POS_2_5", "POS_3_2", "222", "364", "365", "366", },
}


function getDataById(key_id)
    local id_data = nor_copydataTable["id_" .. key_id]
    if id_data == nil then
        return nil
    end
    return id_data
end

function getArrDataByField(fieldName, fieldValue)
    local arrData = {}
    local fieldNo = 1
    for i=1, #keys do
        if keys[i] == fieldName then
            fieldNo = i
            break
        end
    end

    for k, v in pairs(nor_copydataTable) do
        if tostring(v[fieldNo-1]) == tostring(fieldValue) then
            table.insert(arrData, copyTab(v))
        end
    end

    return arrData
end

function getTable()
    return nor_copydataTable
end


function getFieldByIdAndIndex(key_id, fieldName)
    local fieldNo = 0
    for i=1, #keys do
        if keys[i] == fieldName then
            fieldNo = i-1
            break
        end
    end
    return getDataById(key_id)[fieldNo]
end


function getIndexByField(fieldName)
    local fieldNo = 0
    for i=1, #keys do
        if keys[i] == fieldName then
            fieldNo = i-1
            break
        end
    end
    return fieldNo
end


function getArrDataBy2Field(fieldName1, fieldValue1, fieldName2, fieldValue2)
	local arrData = {}
	local fieldNo1 = 1
	local fieldNo2 = 1
	for i=1, #keys do
		if keys[i] == fieldName1 then
			fieldNo1 = i
		end
		if keys[i] == fieldName2 then
			fieldNo2 = i
		end
	end

    for k, v in pairs(nor_copydataTable) do
        if tostring(v[fieldNo1-1]) == tostring(fieldValue1) and tostring(v[fieldNo2-1]) == tostring(fieldValue2)  then
            table.insert(arrData, copyTab(v))
        end
    end

    return arrData
end



function release()
    _G["nor_copydata"] = nil
    package.loaded["nor_copydata"] = nil
end
