-- Description: auto-created by ExcelToLua tool.
-- Author:jjc

module("talent", package.seeall)


keys = {
	"﻿talentID", "talentName", "talentDes", "attack", "wufang", "fafang", "hp", "duoshan", "crit", "shipo", "mingzhong", 
}

talentTable = {
    id_1 = {"1标准", "生命A,攻击E,物防E,法防E,物闪E,法破E,命中E,暴击E", "0.725", "0.5", "0.5", "2", "10", "6", "10", "10", },
    id_2 = {"2标准", "生命E,攻击E,物防E,法防E,物闪E,法破E,命中E,暴击E", "0.75", "0.55", "0.55", "1.35", "12", "9", "12", "11", },
    id_3 = {"3标准", "生命E,攻击E,物防E,法防E,物闪E,法破E,命中E,暴击E", "0.775", "0.6", "0.6", "1.4", "14", "12", "14", "12", },
    id_4 = {"4标准", "生命D,攻击D,物防F,法防F,物闪D,法破D,命中D,暴击D", "0.8", "0.65", "0.65", "1.45", "16", "15", "16", "13", },
    id_5 = {"5标准", "生命D,攻击D,物防D,法防D,物闪D,法破D,命中D,暴击D", "0.825", "0.7", "0.7", "1.5", "18", "18", "18", "14", },
    id_6 = {"6标准", "生命D,攻击D,物防D,法防D,物闪D,法破D,命中D,暴击D", "0.85", "0.75", "0.75", "1.55", "20", "21", "20", "15", },
    id_7 = {"7标准", "生命C,攻击C,物防C,法防C,物闪C,法破C,命中C,暴击C", "0.875", "0.8", "0.8", "1.6", "22", "24", "22", "16", },
    id_8 = {"8标准", "生命C,攻击C,物防C,法防C,物闪C,法破C,命中C,暴击C", "0.9", "0.85", "0.85", "1.65", "24", "27", "24", "17", },
    id_9 = {"9标准", "生命C,攻击C,物防C,法防C,物闪C,法破C,命中C,暴击C", "0.925", "0.9", "0.9", "1.7", "26", "30", "26", "18", },
    id_10 = {"10标准", "生命B,攻击B,物防B,法防B,物闪B,法破B,命中B,暴击B", "0.95", "0.95", "0.95", "1.75", "28", "33", "28", "19", },
    id_11 = {"11标准", "生命B,攻击B,物防B,法防B,物闪B,法破B,命中B,暴击B", "0.975", "1", "1", "1.8", "30", "36", "30", "20", },
    id_12 = {"12标准", "生命B,攻击B,物防B,法防B,物闪B,法破B,命中B,暴击B", "1", "1.05", "1.05", "1.85", "32", "39", "32", "21", },
    id_13 = {"13标准", "生命A,攻击A,物防A,法防A,物闪A,法破A,命中A,暴击A", "1.025", "1.1", "1.1", "1.9", "34", "42", "34", "22", },
    id_14 = {"14标准", "生命A,攻击A,物防A,法防A,物闪A,法破A,命中A,暴击A", "1.05", "1.15", "1.15", "1.95", "36", "45", "36", "23", },
    id_15 = {"1物防", "生命5S,攻击E,物防B,法防F,物闪A,法破A,命中A,暴击E", "0.725", "1.05", "0.65", "2.65", "34", "6", "34", "22", },
    id_16 = {"2物防", "生命5S,攻击E,物防A,法防D,物闪A,法破A,命中A,暴击E", "0.75", "1.1", "0.7", "2.7", "36", "9", "36", "23", },
    id_17 = {"3物防", "生命5S,攻击E,物防A,法防D,物闪A,法破A,命中A,暴击E", "0.775", "1.15", "0.75", "2.75", "38", "12", "38", "24", },
    id_18 = {"4物防", "生命6S,攻击D,物防A,法防C,物闪S,法破S,命中S,暴击D", "0.8", "1.2", "0.8", "2.8", "40", "15", "40", "25", },
    id_19 = {"5物防", "生命6S,攻击D,物防S,法防C,物闪S,法破S,命中S,暴击D", "0.825", "1.25", "0.85", "2.85", "42", "18", "42", "26", },
    id_20 = {"6物防", "生命6S,攻击D,物防S,法防C,物闪S,法破S,命中S,暴击D", "0.85", "1.3", "0.9", "2.9", "44", "21", "44", "27", },
    id_21 = {"7物防", "生命7S,攻击C,物防S,法防B,物闪2S,法破2S,命中2S,暴击C", "0.875", "1.35", "0.95", "2.95", "46", "24", "46", "28", },
    id_22 = {"8物防", "生命7S,攻击C,物防2S,法防B,物闪2S,法破2S,命中2S,暴击C", "0.9", "1.4", "1", "3", "48", "27", "48", "29", },
    id_23 = {"9物防", "生命7S,攻击C,物防2S,法防B,物闪2S,法破2S,命中2S,暴击C", "0.925", "1.45", "1.05", "3.05", "50", "30", "50", "30", },
    id_24 = {"10物防", "生命8S,攻击B,物防2S,法防A,物闪3S,法破3S,命中3S,暴击B", "0.95", "1.5", "1.1", "3.1", "52", "33", "52", "31", },
    id_25 = {"11物防", "生命8S,攻击B,物防3S,法防A,物闪3S,法破3S,命中3S,暴击B", "0.975", "1.55", "1.15", "3.15", "54", "36", "54", "32", },
    id_26 = {"12物防", "生命8S,攻击B,物防3S,法防A,物闪3S,法破3S,命中3S,暴击B", "1", "1.6", "1.2", "3.2", "56", "39", "56", "33", },
    id_27 = {"13物防", "生命9S,攻击A,物防3S,法防S,物闪4S,法破4S,命中4S,暴击A", "1.025", "1.65", "1.25", "3.25", "58", "42", "58", "34", },
    id_28 = {"14物防", "生命9S,攻击A,物防4S,法防S,物闪4S,法破4S,命中4S,暴击A", "1.05", "1.7", "1.3", "3.3", "60", "45", "60", "35", },
    id_29 = {"1法防", "生命5S,攻击E,物防F,法防B,物闪A,法破A,命中A,暴击E", "0.725", "0.65", "1.05", "2.65", "34", "6", "34", "22", },
    id_30 = {"2法防", "生命5S,攻击E,物防D,法防A,物闪A,法破A,命中A,暴击E", "0.75", "0.7", "1.1", "2.7", "36", "9", "36", "23", },
    id_31 = {"3法防", "生命5S,攻击E,物防D,法防A,物闪A,法破A,命中A,暴击E", "0.775", "0.75", "1.15", "2.75", "38", "12", "38", "24", },
    id_32 = {"4法防", "生命6S,攻击D,物防C,法防A,物闪S,法破S,命中S,暴击D", "0.8", "0.8", "1.2", "2.8", "40", "15", "40", "25", },
    id_33 = {"5法防", "生命6S,攻击D,物防C,法防S,物闪S,法破S,命中S,暴击D", "0.825", "0.85", "1.25", "2.85", "42", "18", "42", "26", },
    id_34 = {"6法防", "生命6S,攻击D,物防C,法防S,物闪S,法破S,命中S,暴击D", "0.85", "0.9", "1.3", "2.9", "44", "21", "44", "27", },
    id_35 = {"7法防", "生命7S,攻击C,物防B,法防S,物闪2S,法破2S,命中2S,暴击C", "0.875", "0.95", "1.35", "2.95", "46", "24", "46", "28", },
    id_36 = {"8法防", "生命7S,攻击C,物防B,法防2S,物闪2S,法破2S,命中2S,暴击C", "0.9", "1", "1.4", "3", "48", "27", "48", "29", },
    id_37 = {"9法防", "生命7S,攻击C,物防B,法防2S,物闪2S,法破2S,命中2S,暴击C", "0.925", "1.05", "1.45", "3.05", "50", "30", "50", "30", },
    id_38 = {"10法防", "生命8S,攻击B,物防A,法防2S,物闪3S,法破3S,命中3S,暴击B", "0.95", "1.1", "1.5", "3.1", "52", "33", "52", "31", },
    id_39 = {"11法防", "生命8S,攻击B,物防A,法防3S,物闪3S,法破3S,命中3S,暴击B", "0.975", "1.15", "1.55", "3.15", "54", "36", "54", "32", },
    id_40 = {"12法防", "生命8S,攻击B,物防A,法防3S,物闪3S,法破3S,命中3S,暴击B", "1", "1.2", "1.6", "3.2", "56", "39", "56", "33", },
    id_41 = {"13法防", "生命9S,攻击A,物防S,法防3S,物闪4S,法破4S,命中4S,暴击A", "1.025", "1.25", "1.65", "3.25", "58", "42", "58", "34", },
    id_42 = {"14法防", "生命9S,攻击A,物防S,法防4S,物闪4S,法破4S,命中4S,暴击A", "1.05", "1.3", "1.7", "3.3", "60", "45", "60", "35", },
    id_43 = {"1物伤", "生命D,攻击2S,物防D,法防F,物闪A,法破A,命中A,暴击E", "1.225", "0.75", "0.65", "1.45", "34", "6", "34", "22", },
    id_44 = {"2物伤", "生命D,攻击3S,物防C,法防D,物闪A,法破A,命中A,暴击E", "1.25", "0.8", "0.7", "1.5", "36", "9", "36", "23", },
    id_45 = {"3物伤", "生命D,攻击3S,物防C,法防D,物闪A,法破A,命中A,暴击E", "1.275", "0.85", "0.75", "1.55", "38", "12", "38", "24", },
    id_46 = {"4物伤", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "1.3", "0.9", "0.8", "1.6", "40", "15", "40", "25", },
    id_47 = {"5物伤", "生命C,攻击4S,物防B,法防C,物闪S,法破S,命中S,暴击D", "1.325", "0.95", "0.85", "1.65", "42", "18", "42", "26", },
    id_48 = {"6物伤", "生命C,攻击4S,物防B,法防C,物闪S,法破S,命中S,暴击D", "1.35", "1", "0.9", "1.7", "44", "21", "44", "27", },
    id_49 = {"7物伤", "生命B,攻击4S,物防B,法防B,物闪2S,法破2S,命中2S,暴击C", "1.375", "1.05", "0.95", "1.75", "46", "24", "46", "28", },
    id_50 = {"8物伤", "生命B,攻击5S,物防A,法防B,物闪2S,法破2S,命中2S,暴击C", "1.4", "1.1", "1", "1.8", "48", "27", "48", "29", },
    id_51 = {"9物伤", "生命B,攻击5S,物防A,法防B,物闪2S,法破2S,命中2S,暴击C", "1.425", "1.15", "1.05", "1.85", "50", "30", "50", "30", },
    id_52 = {"10物伤", "生命A,攻击5S,物防A,法防A,物闪3S,法破3S,命中3S,暴击B", "1.45", "1.2", "1.1", "1.9", "52", "33", "52", "31", },
    id_53 = {"11物伤", "生命A,攻击6S,物防S,法防A,物闪3S,法破3S,命中3S,暴击B", "1.475", "1.25", "1.15", "1.95", "54", "36", "54", "32", },
    id_54 = {"12物伤", "生命A,攻击6S,物防S,法防A,物闪3S,法破3S,命中3S,暴击B", "1.5", "1.3", "1.2", "2", "56", "39", "56", "33", },
    id_55 = {"13物伤", "生命S,攻击6S,物防S,法防S,物闪4S,法破4S,命中4S,暴击A", "1.525", "1.35", "1.25", "2.05", "58", "42", "58", "34", },
    id_56 = {"14物伤", "生命S,攻击7S,物防2S,法防S,物闪4S,法破4S,命中4S,暴击A", "1.55", "1.4", "1.3", "2.1", "60", "45", "60", "35", },
    id_57 = {"1法伤", "生命D,攻击2S,物防F,法防D,物闪A,法破A,命中A,暴击E", "1.225", "0.65", "0.75", "1.45", "34", "6", "34", "22", },
    id_58 = {"2法伤", "生命D,攻击3S,物防D,法防C,物闪A,法破A,命中A,暴击E", "1.25", "0.7", "0.8", "1.5", "36", "9", "36", "23", },
    id_59 = {"3法伤", "生命D,攻击3S,物防D,法防C,物闪A,法破A,命中A,暴击E", "1.275", "0.75", "0.85", "1.55", "38", "12", "38", "24", },
    id_60 = {"4法伤", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "1.3", "0.8", "0.9", "1.6", "40", "15", "40", "25", },
    id_61 = {"5法伤", "生命C,攻击4S,物防C,法防B,物闪S,法破S,命中S,暴击D", "1.325", "0.85", "0.95", "1.65", "42", "18", "42", "26", },
    id_62 = {"6法伤", "生命C,攻击4S,物防C,法防B,物闪S,法破S,命中S,暴击D", "1.35", "0.9", "1", "1.7", "44", "21", "44", "27", },
    id_63 = {"7法伤", "生命B,攻击4S,物防B,法防B,物闪2S,法破2S,命中2S,暴击C", "1.375", "0.95", "1.05", "1.75", "46", "24", "46", "28", },
    id_64 = {"8法伤", "生命B,攻击5S,物防B,法防A,物闪2S,法破2S,命中2S,暴击C", "1.4", "1", "1.1", "1.8", "48", "27", "48", "29", },
    id_65 = {"9法伤", "生命B,攻击5S,物防B,法防A,物闪2S,法破2S,命中2S,暴击C", "1.425", "1.05", "1.15", "1.85", "50", "30", "50", "30", },
    id_66 = {"10法伤", "生命A,攻击5S,物防A,法防A,物闪3S,法破3S,命中3S,暴击B", "1.45", "1.1", "1.2", "1.9", "52", "33", "52", "31", },
    id_67 = {"11法伤", "生命A,攻击6S,物防A,法防S,物闪3S,法破3S,命中3S,暴击B", "1.475", "1.15", "1.25", "1.95", "54", "36", "54", "32", },
    id_68 = {"12法伤", "生命A,攻击6S,物防A,法防S,物闪3S,法破3S,命中3S,暴击B", "1.5", "1.2", "1.3", "2", "56", "39", "56", "33", },
    id_69 = {"13法伤", "生命S,攻击6S,物防S,法防S,物闪4S,法破4S,命中4S,暴击A", "1.525", "1.25", "1.35", "2.05", "58", "42", "58", "34", },
    id_70 = {"14法伤", "生命S,攻击7S,物防S,法防2S,物闪4S,法破4S,命中4S,暴击A", "1.55", "1.3", "1.4", "2.1", "60", "45", "60", "35", },
    id_71 = {"1物闪", "生命2S,攻击D,物防C,法防D,物闪2S,法破A,命中A,暴击E", "0.825", "0.85", "0.75", "2.25", "48", "6", "34", "22", },
    id_72 = {"2物闪", "生命2S,攻击D,物防C,法防C,物闪2S,法破A,命中A,暴击E", "0.85", "0.9", "0.8", "2.3", "50", "9", "36", "23", },
    id_73 = {"3物闪", "生命3S,攻击C,物防B,法防C,物闪3S,法破A,命中A,暴击E", "0.875", "0.95", "0.85", "2.35", "52", "12", "38", "24", },
    id_74 = {"4物闪", "生命3S,攻击C,物防B,法防C,物闪3S,法破S,命中S,暴击D", "0.9", "1", "0.9", "2.4", "54", "15", "40", "25", },
    id_75 = {"5物闪", "生命3S,攻击C,物防B,法防B,物闪3S,法破S,命中S,暴击D", "0.925", "1.05", "0.95", "2.45", "56", "18", "42", "26", },
    id_76 = {"6物闪", "生命4S,攻击B,物防A,法防B,物闪4S,法破S,命中S,暴击D", "0.95", "1.1", "1", "2.5", "58", "21", "44", "27", },
    id_77 = {"7物闪", "生命4S,攻击B,物防A,法防B,物闪4S,法破2S,命中2S,暴击C", "0.975", "1.15", "1.05", "2.55", "60", "24", "46", "28", },
    id_78 = {"8物闪", "生命4S,攻击B,物防A,法防A,物闪4S,法破2S,命中2S,暴击C", "1", "1.2", "1.1", "2.6", "62", "27", "48", "29", },
    id_79 = {"9物闪", "生命5S,攻击A,物防S,法防A,物闪5S,法破2S,命中2S,暴击C", "1.025", "1.25", "1.15", "2.65", "64", "30", "50", "30", },
    id_80 = {"10物闪", "生命5S,攻击A,物防S,法防A,物闪5S,法破3S,命中3S,暴击B", "1.05", "1.3", "1.2", "2.7", "66", "33", "52", "31", },
    id_81 = {"11物闪", "生命5S,攻击A,物防S,法防S,物闪5S,法破3S,命中3S,暴击B", "1.075", "1.35", "1.25", "2.75", "68", "36", "54", "32", },
    id_82 = {"12物闪", "生命6S,攻击S,物防2S,法防S,物闪6S,法破3S,命中3S,暴击B", "1.1", "1.4", "1.3", "2.8", "70", "39", "56", "33", },
    id_83 = {"13物闪", "生命6S,攻击S,物防2S,法防S,物闪6S,法破4S,命中4S,暴击A", "1.125", "1.45", "1.35", "2.85", "70", "42", "58", "34", },
    id_84 = {"14物闪", "生命6S,攻击S,物防2S,法防2S,物闪6S,法破4S,命中4S,暴击A", "1.15", "1.5", "1.4", "2.9", "70", "45", "60", "35", },
    id_85 = {"1法破", "生命2S,攻击D,物防D,法防C,物闪A,法破3S,命中A,暴击E", "0.825", "0.75", "0.85", "2.25", "34", "6", "54", "22", },
    id_86 = {"2法破", "生命2S,攻击D,物防C,法防C,物闪A,法破3S,命中A,暴击E", "0.85", "0.8", "0.9", "2.3", "36", "9", "56", "23", },
    id_87 = {"3法破", "生命3S,攻击C,物防C,法防B,物闪A,法破4S,命中A,暴击E", "0.875", "0.85", "0.95", "2.35", "38", "12", "58", "24", },
    id_88 = {"4法破", "生命3S,攻击C,物防C,法防B,物闪S,法破4S,命中S,暴击D", "0.9", "0.9", "1", "2.4", "40", "15", "60", "25", },
    id_89 = {"5法破", "生命3S,攻击C,物防B,法防B,物闪S,法破4S,命中S,暴击D", "0.925", "0.95", "1.05", "2.45", "42", "18", "62", "26", },
    id_90 = {"6法破", "生命4S,攻击B,物防B,法防A,物闪S,法破5S,命中S,暴击D", "0.95", "1", "1.1", "2.5", "44", "21", "64", "27", },
    id_91 = {"7法破", "生命4S,攻击B,物防B,法防A,物闪2S,法破5S,命中2S,暴击C", "0.975", "1.05", "1.15", "2.55", "46", "24", "66", "28", },
    id_92 = {"8法破", "生命4S,攻击B,物防A,法防A,物闪2S,法破5S,命中2S,暴击C", "1", "1.1", "1.2", "2.6", "48", "27", "68", "29", },
    id_93 = {"9法破", "生命5S,攻击A,物防A,法防S,物闪2S,法破6S,命中2S,暴击C", "1.025", "1.15", "1.25", "2.65", "50", "30", "70", "30", },
    id_94 = {"10法破", "生命5S,攻击A,物防A,法防S,物闪3S,法破6S,命中3S,暴击B", "1.05", "1.2", "1.3", "2.7", "52", "33", "70", "31", },
    id_95 = {"11法破", "生命5S,攻击A,物防S,法防S,物闪3S,法破6S,命中3S,暴击B", "1.075", "1.25", "1.35", "2.75", "54", "36", "70", "32", },
    id_96 = {"12法破", "生命6S,攻击S,物防S,法防2S,物闪3S,法破6S,命中3S,暴击B", "1.1", "1.3", "1.4", "2.8", "56", "39", "70", "33", },
    id_97 = {"13法破", "生命6S,攻击S,物防S,法防2S,物闪4S,法破6S,命中4S,暴击A", "1.125", "1.35", "1.45", "2.85", "58", "42", "70", "34", },
    id_98 = {"14法破", "生命6S,攻击S,物防2S,法防2S,物闪4S,法破6S,命中4S,暴击A", "1.15", "1.4", "1.5", "2.9", "60", "45", "70", "35", },
    id_99 = {"1物暴", "生命D,攻击S,物防F,法防F,物闪A,法破A,命中A,暴击D", "1.125", "0.65", "0.65", "1.45", "34", "21", "34", "22", },
    id_100 = {"2物暴", "生命D,攻击S,物防D,法防D,物闪A,法破A,命中A,暴击C", "1.15", "0.7", "0.7", "1.5", "36", "24", "36", "23", },
    id_101 = {"3物暴", "生命D,攻击2S,物防D,法防D,物闪A,法破A,命中A,暴击C", "1.175", "0.75", "0.75", "1.55", "38", "27", "38", "24", },
    id_102 = {"4物暴", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "1.2", "0.8", "0.8", "1.6", "40", "30", "40", "25", },
    id_103 = {"5物暴", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击B", "1.225", "0.85", "0.85", "1.65", "42", "33", "42", "26", },
    id_104 = {"6物暴", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击B", "1.25", "0.9", "0.9", "1.7", "44", "36", "44", "27", },
    id_105 = {"7物暴", "生命B,攻击3S,物防B,法防B,物闪2S,法破2S,命中2S,暴击B", "1.275", "0.95", "0.95", "1.75", "46", "39", "46", "28", },
    id_106 = {"8物暴", "生命B,攻击3S,物防B,法防B,物闪2S,法破2S,命中2S,暴击A", "1.3", "1", "1", "1.8", "48", "42", "48", "29", },
    id_107 = {"9物暴", "生命B,攻击4S,物防B,法防B,物闪2S,法破2S,命中2S,暴击A", "1.325", "1.05", "1.05", "1.85", "50", "45", "50", "30", },
    id_108 = {"10物暴", "生命A,攻击4S,物防A,法防A,物闪3S,法破3S,命中3S,暴击A", "1.35", "1.1", "1.1", "1.9", "52", "48", "52", "31", },
    id_109 = {"11物暴", "生命A,攻击4S,物防A,法防A,物闪3S,法破3S,命中3S,暴击S", "1.375", "1.15", "1.15", "1.95", "54", "51", "54", "32", },
    id_110 = {"12物暴", "生命A,攻击5S,物防A,法防A,物闪3S,法破3S,命中3S,暴击S", "1.4", "1.2", "1.2", "2", "56", "54", "56", "33", },
    id_111 = {"13物暴", "生命S,攻击5S,物防S,法防S,物闪4S,法破4S,命中4S,暴击S", "1.425", "1.25", "1.25", "2.05", "58", "57", "58", "34", },
    id_112 = {"14物暴", "生命S,攻击5S,物防S,法防S,物闪4S,法破4S,命中4S,暴击2S", "1.45", "1.3", "1.3", "2.1", "60", "60", "60", "35", },
    id_113 = {"1法暴", "生命D,攻击S,物防F,法防F,物闪A,法破A,命中A,暴击D", "1.125", "0.65", "0.65", "1.45", "34", "21", "34", "22", },
    id_114 = {"2法暴", "生命D,攻击S,物防D,法防D,物闪A,法破A,命中A,暴击C", "1.15", "0.7", "0.7", "1.5", "36", "24", "36", "23", },
    id_115 = {"3法暴", "生命D,攻击2S,物防D,法防D,物闪A,法破A,命中A,暴击C", "1.175", "0.75", "0.75", "1.55", "38", "27", "38", "24", },
    id_116 = {"4法暴", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "1.2", "0.8", "0.8", "1.6", "40", "30", "40", "25", },
    id_117 = {"5法暴", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击B", "1.225", "0.85", "0.85", "1.65", "42", "33", "42", "26", },
    id_118 = {"6法暴", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击B", "1.25", "0.9", "0.9", "1.7", "44", "36", "44", "27", },
    id_119 = {"7法暴", "生命B,攻击3S,物防B,法防B,物闪2S,法破2S,命中2S,暴击B", "1.275", "0.95", "0.95", "1.75", "46", "39", "46", "28", },
    id_120 = {"8法暴", "生命B,攻击3S,物防B,法防B,物闪2S,法破2S,命中2S,暴击A", "1.3", "1", "1", "1.8", "48", "42", "48", "29", },
    id_121 = {"9法暴", "生命B,攻击4S,物防B,法防B,物闪2S,法破2S,命中2S,暴击A", "1.325", "1.05", "1.05", "1.85", "50", "45", "50", "30", },
    id_122 = {"10法暴", "生命A,攻击4S,物防A,法防A,物闪3S,法破3S,命中3S,暴击A", "1.35", "1.1", "1.1", "1.9", "52", "48", "52", "31", },
    id_123 = {"11法暴", "生命A,攻击4S,物防A,法防A,物闪3S,法破3S,命中3S,暴击S", "1.375", "1.15", "1.15", "1.95", "54", "51", "54", "32", },
    id_124 = {"12法暴", "生命A,攻击5S,物防A,法防A,物闪3S,法破3S,命中3S,暴击S", "1.4", "1.2", "1.2", "2", "56", "54", "56", "33", },
    id_125 = {"13法暴", "生命S,攻击5S,物防S,法防S,物闪4S,法破4S,命中4S,暴击S", "1.425", "1.25", "1.25", "2.05", "58", "57", "58", "34", },
    id_126 = {"14法暴", "生命S,攻击5S,物防S,法防S,物闪4S,法破4S,命中4S,暴击2S", "1.45", "1.3", "1.3", "2.1", "60", "60", "60", "35", },
    id_127 = {"1物命", "生命D,攻击A,物防C,法防D,物闪A,法破A,命中5S,暴击E", "1.025", "0.85", "0.75", "1.45", "34", "6", "34", "37", },
    id_128 = {"2物命", "生命D,攻击A,物防C,法防C,物闪A,法破A,命中5S,暴击E", "1.05", "0.9", "0.8", "1.5", "36", "9", "36", "38", },
    id_129 = {"3物命", "生命D,攻击A,物防B,法防C,物闪A,法破A,命中5S,暴击E", "1.075", "0.95", "0.85", "1.55", "38", "12", "38", "39", },
    id_130 = {"4物命", "生命C,攻击S,物防B,法防C,物闪S,法破S,命中6S,暴击D", "1.1", "1", "0.9", "1.6", "40", "15", "40", "40", },
    id_131 = {"5物命", "生命C,攻击S,物防B,法防B,物闪S,法破S,命中6S,暴击D", "1.125", "1.05", "0.95", "1.65", "42", "18", "42", "41", },
    id_132 = {"6物命", "生命C,攻击S,物防A,法防B,物闪S,法破S,命中6S,暴击D", "1.15", "1.1", "1", "1.7", "44", "21", "44", "42", },
    id_133 = {"7物命", "生命B,攻击2S,物防A,法防B,物闪2S,法破2S,命中7S,暴击C", "1.175", "1.15", "1.05", "1.75", "46", "24", "46", "43", },
    id_134 = {"8物命", "生命B,攻击2S,物防A,法防A,物闪2S,法破2S,命中7S,暴击C", "1.2", "1.2", "1.1", "1.8", "48", "27", "48", "44", },
    id_135 = {"9物命", "生命B,攻击2S,物防S,法防A,物闪2S,法破2S,命中7S,暴击C", "1.225", "1.25", "1.15", "1.85", "50", "30", "50", "45", },
    id_136 = {"10物命", "生命A,攻击3S,物防S,法防A,物闪3S,法破3S,命中8S,暴击B", "1.25", "1.3", "1.2", "1.9", "52", "33", "52", "46", },
    id_137 = {"11物命", "生命A,攻击3S,物防S,法防S,物闪3S,法破3S,命中8S,暴击B", "1.275", "1.35", "1.25", "1.95", "54", "36", "54", "47", },
    id_138 = {"12物命", "生命A,攻击3S,物防2S,法防S,物闪3S,法破3S,命中8S,暴击B", "1.3", "1.4", "1.3", "2", "56", "39", "56", "48", },
    id_139 = {"13物命", "生命S,攻击4S,物防2S,法防S,物闪4S,法破4S,命中9S,暴击A", "1.325", "1.45", "1.35", "2.05", "58", "42", "58", "49", },
    id_140 = {"14物命", "生命S,攻击4S,物防2S,法防2S,物闪4S,法破4S,命中9S,暴击A", "1.35", "1.5", "1.4", "2.1", "60", "45", "60", "50", },
    id_141 = {"1法命", "生命D,攻击A,物防D,法防C,物闪A,法破A,命中5S,暴击E", "1.025", "0.75", "0.85", "1.45", "34", "6", "34", "37", },
    id_142 = {"2法命", "生命D,攻击A,物防C,法防C,物闪A,法破A,命中5S,暴击E", "1.05", "0.8", "0.9", "1.5", "36", "9", "36", "38", },
    id_143 = {"3法命", "生命D,攻击A,物防C,法防B,物闪A,法破A,命中5S,暴击E", "1.075", "0.85", "0.95", "1.55", "38", "12", "38", "39", },
    id_144 = {"4法命", "生命C,攻击S,物防C,法防B,物闪S,法破S,命中6S,暴击D", "1.1", "0.9", "1", "1.6", "40", "15", "40", "40", },
    id_145 = {"5法命", "生命C,攻击S,物防B,法防B,物闪S,法破S,命中6S,暴击D", "1.125", "0.95", "1.05", "1.65", "42", "18", "42", "41", },
    id_146 = {"6法命", "生命C,攻击S,物防B,法防A,物闪S,法破S,命中6S,暴击D", "1.15", "1", "1.1", "1.7", "44", "21", "44", "42", },
    id_147 = {"7法命", "生命B,攻击2S,物防B,法防A,物闪2S,法破2S,命中7S,暴击C", "1.175", "1.05", "1.15", "1.75", "46", "24", "46", "43", },
    id_148 = {"8法命", "生命B,攻击2S,物防A,法防A,物闪2S,法破2S,命中7S,暴击C", "1.2", "1.1", "1.2", "1.8", "48", "27", "48", "44", },
    id_149 = {"9法命", "生命B,攻击2S,物防A,法防S,物闪2S,法破2S,命中7S,暴击C", "1.225", "1.15", "1.25", "1.85", "50", "30", "50", "45", },
    id_150 = {"10法命", "生命A,攻击3S,物防A,法防S,物闪3S,法破3S,命中8S,暴击B", "1.25", "1.2", "1.3", "1.9", "52", "33", "52", "46", },
    id_151 = {"11法命", "生命A,攻击3S,物防S,法防S,物闪3S,法破3S,命中8S,暴击B", "1.275", "1.25", "1.35", "1.95", "54", "36", "54", "47", },
    id_152 = {"12法命", "生命A,攻击3S,物防S,法防2S,物闪3S,法破3S,命中8S,暴击B", "1.3", "1.3", "1.4", "2", "56", "39", "56", "48", },
    id_153 = {"13法命", "生命S,攻击4S,物防S,法防2S,物闪4S,法破4S,命中9S,暴击A", "1.325", "1.35", "1.45", "2.05", "58", "42", "58", "49", },
    id_154 = {"14法命", "生命S,攻击4S,物防2S,法防2S,物闪4S,法破4S,命中9S,暴击A", "1.35", "1.4", "1.5", "2.1", "60", "45", "60", "50", },
    id_8011 = {"战士", "生命3S,攻击B,物防A,法防B,物闪S,法破S,命中S,暴击D", "0.7", "0.77", "0.7", "1.68", "40", "15", "40", "25", },
    id_8012 = {"猛将", "生命3S,攻击A,物防A,法防B,物闪S,法破S,命中S,暴击D", "0.7175", "0.805", "0.735", "1.715", "42", "18", "42", "26", },
    id_8013 = {"霸者", "生命4S,攻击A,物防A,法防A,物闪S,法破S,命中S,暴击D", "0.735", "0.84", "0.77", "1.75", "44", "21", "44", "27", },
    id_8021 = {"谋士", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.63", "0.56", "1.12", "40", "15", "40", "25", },
    id_8032 = {"策士", "生命C,攻击4S,物防B,法防C,物闪S,法破S,命中S,暴击D", "0.9275", "0.665", "0.595", "1.155", "42", "18", "42", "26", },
    id_8043 = {"天师", "生命C,攻击4S,物防B,法防C,物闪S,法破S,命中S,暴击D", "0.945", "0.7", "0.63", "1.19", "44", "21", "44", "27", },
    id_8031 = {"弓手", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.56", "0.63", "1.12", "40", "15", "40", "25", },
    id_8042 = {"飞羽", "生命C,攻击4S,物防C,法防B,物闪S,法破S,命中S,暴击D", "0.9275", "0.595", "0.665", "1.155", "42", "18", "42", "26", },
    id_8053 = {"翎羽", "生命C,攻击4S,物防C,法防B,物闪S,法破S,命中S,暴击D", "0.945", "0.63", "0.7", "1.19", "44", "21", "44", "27", },
    id_6001 = {"倾国倾城", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6002 = {"武神关圣", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.63", "0.56", "1.12", "40", "15", "40", "25", },
    id_6003 = {"白马神将", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6004 = {"锦帆大将", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6005 = {"武极天下", "生命3S,攻击C,物防B,法防C,物闪3S,法破S,命中S,暴击D", "0.63", "0.7", "0.63", "1.68", "39.96", "15", "40", "25", },
    id_6006 = {"西域天狼", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.63", "0.56", "1.12", "40", "15", "40", "25", },
    id_6007 = {"悬壶济世", "生命6S,攻击D,物防C,法防A,物闪S,法破S,命中S,暴击D", "0.56", "0.56", "0.84", "1.96", "40", "15", "40", "25", },
    id_6008 = {"骠骑大将", "生命6S,攻击D,物防A,法防C,物闪S,法破S,命中S,暴击D", "0.56", "0.84", "0.56", "1.96", "40", "15", "40", "25", },
    id_6009 = {"中原霸主", "生命3S,攻击C,物防C,法防B,物闪S,法破4S,命中S,暴击D", "0.63", "0.63", "0.7", "1.68", "40", "15", "42", "25", },
    id_6010 = {"古之恶来", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6011 = {"狼戾贼忍", "生命6S,攻击D,物防A,法防C,物闪S,法破S,命中S,暴击D", "0.56", "0.84", "0.56", "1.96", "40", "15", "40", "25", },
    id_6012 = {"勇者无敌", "生命3S,攻击C,物防B,法防C,物闪3S,法破S,命中S,暴击D", "0.63", "0.7", "0.63", "1.68", "39.96", "15", "40", "25", },
    id_6013 = {"智通寰宇", "生命3S,攻击C,物防C,法防B,物闪S,法破4S,命中S,暴击D", "0.63", "0.63", "0.7", "1.68", "40", "15", "42", "25", },
    id_6014 = {"博文晓律", "生命6S,攻击D,物防C,法防A,物闪S,法破S,命中S,暴击D", "0.56", "0.56", "0.84", "1.96", "40", "15", "40", "25", },
    id_6015 = {"神智妇人", "生命6S,攻击D,物防C,法防A,物闪S,法破S,命中S,暴击D", "0.56", "0.56", "0.84", "1.96", "40", "15", "40", "25", },
    id_6016 = {"火神后裔", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6017 = {"貔貅之将", "生命3S,攻击C,物防B,法防C,物闪3S,法破S,命中S,暴击D", "0.63", "0.7", "0.63", "1.68", "39.96", "15", "40", "25", },
    id_6018 = {"天公将军", "生命3S,攻击C,物防C,法防B,物闪S,法破4S,命中S,暴击D", "0.63", "0.63", "0.7", "1.68", "40", "15", "42", "25", },
    id_6019 = {"东莱神将", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.63", "0.56", "1.12", "40", "15", "40", "25", },
    id_6020 = {"神威将军", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.63", "0.56", "1.12", "40", "15", "40", "25", },
    id_6021 = {"西凉猛将", "生命6S,攻击D,物防A,法防C,物闪S,法破S,命中S,暴击D", "0.56", "0.84", "0.56", "1.96", "40", "15", "40", "25", },
    id_6022 = {"料事如神", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6023 = {"明哲保身", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.56", "0.63", "1.12", "40", "15", "40", "25", },
    id_6024 = {"南蛮之主", "生命3S,攻击C,物防B,法防C,物闪3S,法破S,命中S,暴击D", "0.63", "0.7", "0.63", "1.68", "39.96", "15", "40", "25", },
    id_6025 = {"仁者无敌", "生命6S,攻击D,物防C,法防A,物闪S,法破S,命中S,暴击D", "0.56", "0.56", "0.84", "1.96", "40", "15", "40", "25", },
    id_6026 = {"治军无敌", "生命3S,攻击C,物防B,法防C,物闪3S,法破S,命中S,暴击D", "0.63", "0.7", "0.63", "1.68", "39.96", "15", "40", "25", },
    id_6027 = {"明主良佐", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6028 = {"勇冠千军", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.63", "0.56", "1.12", "40", "15", "40", "25", },
    id_6029 = {"武力既弘", "生命6S,攻击D,物防A,法防C,物闪S,法破S,命中S,暴击D", "0.56", "0.84", "0.56", "1.96", "40", "15", "40", "25", },
    id_6030 = {"奇谋如神", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6031 = {"军神无敌", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6032 = {"终于克己", "生命6S,攻击D,物防C,法防A,物闪S,法破S,命中S,暴击D", "0.56", "0.56", "0.84", "1.96", "40", "15", "40", "25", },
    id_6033 = {"智通人和", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6034 = {"无畏猛虎", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.63", "0.56", "1.12", "40", "15", "40", "25", },
    id_6035 = {"儒袍军神", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.56", "0.63", "1.12", "40", "15", "40", "25", },
    id_6036 = {"一代名将", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6037 = {"英烈壮节", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6038 = {"巾帼英雄", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6039 = {"无盐才女", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6040 = {"洛水神女", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6041 = {"陈震忠恪", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.56", "0.63", "1.12", "40", "15", "40", "25", },
    id_6042 = {"权谋盖世", "生命3S,攻击C,物防C,法防B,物闪S,法破4S,命中S,暴击D", "0.63", "0.63", "0.7", "1.68", "40", "15", "42", "25", },
    id_6043 = {"东吴大帝", "生命6S,攻击D,物防C,法防A,物闪S,法破S,命中S,暴击D", "0.56", "0.56", "0.84", "1.96", "40", "15", "40", "25", },
    id_6044 = {"不屈战神", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.63", "0.56", "1.12", "40", "15", "40", "25", },
    id_6045 = {"巨力虎痴", "生命6S,攻击D,物防A,法防C,物闪S,法破S,命中S,暴击D", "0.56", "0.84", "0.56", "1.96", "40", "15", "40", "25", },
    id_6046 = {"一代才女", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.56", "0.63", "1.12", "40", "15", "40", "25", },
    id_6047 = {"江东女神", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.56", "0.63", "1.12", "40", "15", "40", "25", },
    id_6048 = {"文武双全", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6049 = {"神鬼策士", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6050 = {"名动天下", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.63", "0.56", "1.12", "40", "15", "40", "25", },
    id_6100 = {"投石问路", "生命5S,攻击E,物防A,法防D,物闪A,法破A,命中A,暴击E", "0.525", "0.77", "0.49", "1.89", "36", "9", "36", "23", },
    id_6101 = {"我有盾牌", "生命D,攻击3S,物防C,法防D,物闪A,法破A,命中A,暴击E", "0.875", "0.56", "0.49", "1.05", "36", "9", "36", "23", },
    id_6102 = {"我有长枪", "生命D,攻击S,物防D,法防D,物闪A,法破A,命中A,暴击C", "0.805", "0.49", "0.49", "1.05", "36", "16.8", "36", "23", },
    id_6103 = {"我有蒲扇", "生命5S,攻击E,物防D,法防A,物闪A,法破A,命中A,暴击E", "0.525", "0.49", "0.77", "1.89", "36", "9", "36", "23", },
    id_6104 = {"我有鼓槌", "生命2S,攻击D,物防C,法防C,物闪2S,法破A,命中A,暴击E", "0.595", "0.63", "0.56", "1.61", "37", "9", "36", "23", },
    id_6105 = {"我有砍刀", "生命D,攻击S,物防D,法防D,物闪A,法破A,命中A,暴击C", "0.805", "0.49", "0.49", "1.05", "36", "16.8", "36", "23", },
    id_6106 = {"我有弓箭", "生命5S,攻击E,物防D,法防A,物闪A,法破A,命中A,暴击E", "0.525", "0.49", "0.77", "1.89", "36", "9", "36", "23", },
    id_6107 = {"我有魂幡", "生命D,攻击S,物防D,法防D,物闪A,法破A,命中A,暴击C", "0.805", "0.49", "0.49", "1.05", "36", "16.8", "36", "23", },
    id_6108 = {"机关战狼", "生命5S,攻击E,物防D,法防A,物闪A,法破A,命中A,暴击E", "0.525", "0.49", "0.77", "1.89", "36", "9", "36", "23", },
    id_6109 = {"披甲战象", "生命2S,攻击D,物防C,法防C,物闪A,法破3S,命中A,暴击E", "0.595", "0.56", "0.63", "1.61", "36", "9", "39.2", "23", },
    id_6110 = {"符咒战熊", "生命D,攻击S,物防D,法防D,物闪A,法破A,命中A,暴击C", "0.805", "0.49", "0.49", "1.05", "36", "16.8", "36", "23", },
    id_6111 = {"迅捷战豹", "生命D,攻击3S,物防D,法防C,物闪A,法破A,命中A,暴击E", "0.875", "0.49", "0.56", "1.05", "36", "9", "36", "23", },
    id_6112 = {"怒吼战狮", "生命D,攻击3S,物防C,法防D,物闪A,法破A,命中A,暴击E", "0.875", "0.56", "0.49", "1.05", "36", "9", "36", "23", },
    id_6113 = {"机关一兵", "生命2S,攻击D,物防C,法防C,物闪2S,法破A,命中A,暴击E", "0.595", "0.63", "0.56", "1.61", "37", "9", "36", "23", },
    id_6114 = {"我要上天", "生命D,攻击S,物防D,法防D,物闪A,法破A,命中A,暴击C", "0.805", "0.49", "0.49", "1.05", "36", "16.8", "36", "23", },
    id_6115 = {"蓝翔毕业", "生命5S,攻击E,物防A,法防D,物闪A,法破A,命中A,暴击E", "0.525", "0.77", "0.49", "1.89", "36", "9", "36", "23", },
    id_6116 = {"可当阵门", "生命D,攻击S,物防D,法防D,物闪A,法破A,命中A,暴击C", "0.805", "0.49", "0.49", "1.05", "36", "16.8", "36", "23", },
    id_6117 = {"我会巫术", "生命5S,攻击E,物防D,法防A,物闪A,法破A,命中A,暴击E", "0.525", "0.49", "0.77", "1.89", "36", "9", "36", "23", },
    id_6118 = {"我会服侍", "生命D,攻击3S,物防D,法防C,物闪A,法破A,命中A,暴击E", "0.875", "0.49", "0.56", "1.05", "36", "9", "36", "23", },
    id_6119 = {"我会跳舞", "生命D,攻击S,物防D,法防D,物闪A,法破A,命中A,暴击C", "0.805", "0.49", "0.49", "1.05", "36", "16.8", "36", "23", },
    id_6120 = {"我会忍术", "生命D,攻击3S,物防D,法防C,物闪A,法破A,命中A,暴击E", "0.875", "0.49", "0.56", "1.05", "36", "9", "36", "23", },
    id_6121 = {"我会飞刀", "生命D,攻击3S,物防C,法防D,物闪A,法破A,命中A,暴击E", "0.875", "0.56", "0.49", "1.05", "36", "9", "36", "23", },
    id_6200 = {"投石问路", "生命6S,攻击D,物防A,法防C,物闪S,法破S,命中S,暴击D", "0.56", "0.84", "0.56", "1.96", "40", "15", "40", "25", },
    id_6201 = {"我有盾牌", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.63", "0.56", "1.12", "40", "15", "40", "25", },
    id_6202 = {"我有长枪", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6203 = {"我有蒲扇", "生命6S,攻击D,物防C,法防A,物闪S,法破S,命中S,暴击D", "0.56", "0.56", "0.84", "1.96", "40", "15", "40", "25", },
    id_6204 = {"我有鼓槌", "生命3S,攻击C,物防B,法防C,物闪3S,法破S,命中S,暴击D", "0.63", "0.7", "0.63", "1.68", "39.96", "15", "40", "25", },
    id_6205 = {"我有砍刀", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6206 = {"我有弓箭", "生命6S,攻击D,物防C,法防A,物闪S,法破S,命中S,暴击D", "0.56", "0.56", "0.84", "1.96", "40", "15", "40", "25", },
    id_6207 = {"我有魂幡", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6208 = {"机关战狼", "生命6S,攻击D,物防C,法防A,物闪S,法破S,命中S,暴击D", "0.56", "0.56", "0.84", "1.96", "40", "15", "40", "25", },
    id_6209 = {"披甲战象", "生命3S,攻击C,物防C,法防B,物闪S,法破4S,命中S,暴击D", "0.63", "0.63", "0.7", "1.68", "40", "15", "42", "25", },
    id_6210 = {"符咒战熊", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6211 = {"迅捷战豹", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.56", "0.63", "1.12", "40", "15", "40", "25", },
    id_6212 = {"怒吼战狮", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.63", "0.56", "1.12", "40", "15", "40", "25", },
    id_6213 = {"机关一兵", "生命3S,攻击C,物防B,法防C,物闪3S,法破S,命中S,暴击D", "0.63", "0.7", "0.63", "1.68", "39.96", "15", "40", "25", },
    id_6214 = {"我要上天", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6215 = {"蓝翔毕业", "生命6S,攻击D,物防A,法防C,物闪S,法破S,命中S,暴击D", "0.56", "0.84", "0.56", "1.96", "40", "15", "40", "25", },
    id_6216 = {"可当阵门", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6217 = {"我会巫术", "生命6S,攻击D,物防C,法防A,物闪S,法破S,命中S,暴击D", "0.56", "0.56", "0.84", "1.96", "40", "15", "40", "25", },
    id_6218 = {"我会服侍", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.56", "0.63", "1.12", "40", "15", "40", "25", },
    id_6219 = {"我会跳舞", "生命C,攻击2S,物防C,法防C,物闪S,法破S,命中S,暴击C", "0.84", "0.56", "0.56", "1.12", "40", "21", "40", "25", },
    id_6220 = {"我会忍术", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.56", "0.63", "1.12", "40", "15", "40", "25", },
    id_6221 = {"我会飞刀", "生命C,攻击3S,物防C,法防C,物闪S,法破S,命中S,暴击D", "0.91", "0.63", "0.56", "1.12", "40", "15", "40", "25", },
    id_7001 = {"太子党", "生命C,攻击4S,物防C,法防B,物闪S,法破S,命中S,暴击D", "0.945", "0.63", "0.7", "1.19", "44", "21", "44", "27", },
    id_7002 = {"芙蓉粉", "生命C,攻击4S,物防C,法防B,物闪S,法破S,命中S,暴击D", "0.945", "0.63", "0.7", "1.19", "44", "21", "44", "27", },
    id_7003 = {"么么哒", "生命C,攻击4S,物防C,法防B,物闪S,法破S,命中S,暴击D", "0.945", "0.63", "0.7", "1.19", "44", "21", "44", "27", },
    id_7004 = {"白富美", "生命C,攻击4S,物防C,法防B,物闪S,法破S,命中S,暴击D", "0.945", "0.63", "0.7", "1.19", "44", "21", "44", "27", },
    id_7005 = {"高富帅", "生命C,攻击4S,物防C,法防B,物闪S,法破S,命中S,暴击D", "0.945", "0.63", "0.7", "1.19", "44", "21", "44", "27", },
    id_7006 = {"道德经", "生命C,攻击4S,物防C,法防B,物闪S,法破S,命中S,暴击D", "0.945", "0.63", "0.7", "1.19", "44", "21", "44", "27", },
}


function getDataById(key_id)
    local id_data = talentTable["id_" .. key_id]
    if id_data == nil then
        return nil
    end
    return id_data
end

function getArrDataByField(fieldName, fieldValue)
    local arrData = {}
    local fieldNo = 1
    for i=1, #keys do
        if keys[i] == fieldName then
            fieldNo = i
            break
        end
    end

    for k, v in pairs(talentTable) do
        if tostring(v[fieldNo-1]) == tostring(fieldValue) then
            table.insert(arrData, copyTab(v))
        end
    end

    return arrData
end

function getTable()
    return talentTable
end


function getFieldByIdAndIndex(key_id, fieldName)
    local fieldNo = 0
    for i=1, #keys do
        if keys[i] == fieldName then
            fieldNo = i-1
            break
        end
    end
    return getDataById(key_id)[fieldNo]
end


function getIndexByField(fieldName)
    local fieldNo = 0
    for i=1, #keys do
        if keys[i] == fieldName then
            fieldNo = i-1
            break
        end
    end
    return fieldNo
end


function getArrDataBy2Field(fieldName1, fieldValue1, fieldName2, fieldValue2)
	local arrData = {}
	local fieldNo1 = 1
	local fieldNo2 = 1
	for i=1, #keys do
		if keys[i] == fieldName1 then
			fieldNo1 = i
		end
		if keys[i] == fieldName2 then
			fieldNo2 = i
		end
	end

    for k, v in pairs(talentTable) do
        if tostring(v[fieldNo1-1]) == tostring(fieldValue1) and tostring(v[fieldNo2-1]) == tostring(fieldValue2)  then
            table.insert(arrData, copyTab(v))
        end
    end

    return arrData
end



function release()
    _G["talent"] = nil
    package.loaded["talent"] = nil
end
